{
  "sun_sign_themes": {
    "Aries": [
      "Bold initiatives and leadership opportunities present themselves",
      "Your natural courage and pioneering spirit are highlighted",
      "Energy and enthusiasm drive your endeavors forward",
      "Taking decisive action comes naturally during this period"
    ],
    "Taurus": [
      "Stability and material security come into focus",
      "Your appreciation for beauty and comfort is heightened",
      "Patience and persistence yield tangible results",
      "Building lasting foundations becomes a priority"
    ],
    "Gemini": [
      "Communication and intellectual pursuits take center stage",
      "Your curiosity and adaptability open new doors",
      "Social connections and information exchange flourish",
      "Versatility and quick thinking serve you well"
    ],
    "Cancer": [
      "Emotional intuition and nurturing instincts are strong",
      "Home and family matters receive special attention",
      "Your protective nature and empathy shine through",
      "Creating emotional security becomes important"
    ],
    "Leo": [
      "Creative expression and personal magnetism are emphasized",
      "Your natural leadership and warmth attract recognition",
      "Self-expression and confidence reach new heights",
      "Generosity and joy radiate from your actions"
    ],
    "Virgo": [
      "Attention to detail and practical service are favored",
      "Your analytical mind and organizational skills excel",
      "Health and daily routines benefit from careful planning",
      "Perfectionism and improvement drive your focus"
    ],
    "Libra": [
      "Harmony and partnership dynamics come to the forefront",
      "Your diplomatic skills and aesthetic sense are highlighted",
      "Balance and fairness guide your decisions",
      "Relationships and collaboration flourish naturally"
    ],
    "Scorpio": [
      "Depth and transformation mark this period",
      "Your intensity and investigative nature are powerful",
      "Hidden matters and profound insights emerge",
      "Emotional power and regeneration are at play"
    ],
    "Sagittarius": [
      "Expansion and adventure call to your spirit",
      "Your philosophical outlook and optimism grow",
      "Learning and exploration open new horizons",
      "Freedom and truth-seeking guide your path"
    ],
    "Capricorn": [
      "Ambition and structural planning are emphasized",
      "Your discipline and long-term vision pay dividends",
      "Career and responsibility demand attention",
      "Building authority and respect through effort"
    ],
    "Aquarius": [
      "Innovation and independence shape your experience",
      "Your humanitarian ideals and originality stand out",
      "Group dynamics and future visions inspire action",
      "Unconventional thinking breaks new ground"
    ],
    "Pisces": [
      "Intuition and spiritual connection deepen",
      "Your compassion and imagination are boundless",
      "Dreams and creative inspiration flow freely",
      "Sensitivity to others' needs guides your actions"
    ]
  },
  "moon_sign_influences": {
    "Aries": "energizing your emotional responses with spontaneity and courage",
    "Taurus": "grounding your feelings in stability and sensory comfort",
    "Gemini": "stimulating your mind with curiosity and need for variety",
    "Cancer": "deepening your emotional sensitivity and nurturing instincts",
    "Leo": "amplifying your need for recognition and creative self-expression",
    "Virgo": "focusing your attention on practical matters and helpful service",
    "Libra": "drawing you toward harmony, beauty, and partnership",
    "Scorpio": "intensifying your emotional depth and desire for transformation",
    "Sagittarius": "inspiring your quest for meaning, freedom, and adventure",
    "Capricorn": "strengthening your emotional discipline and ambition",
    "Aquarius": "heightening your need for independence and social ideals",
    "Pisces": "enhancing your empathy, intuition, and spiritual connection"
  },
  "element_combinations": {
    "Fire_Fire": "double fire energy creates intense passion, confidence, and dynamic action",
    "Fire_Earth": "fire and earth blend initiative with practicality, creating productive momentum",
    "Fire_Air": "fire and air unite enthusiasm with ideas, sparking inspired communication",
    "Fire_Water": "fire and water combine passion with intuition, balancing action and feeling",
    "Earth_Fire": "earth and fire merge stability with drive, grounding ambitious energy",
    "Earth_Earth": "double earth energy emphasizes material focus, reliability, and tangible results",
    "Earth_Air": "earth and air balance practical thinking with intellectual exploration",
    "Earth_Water": "earth and water blend sensory awareness with emotional depth",
    "Air_Fire": "air and fire join mental agility with bold expression and enthusiasm",
    "Air_Earth": "air and earth combine logical analysis with practical application",
    "Air_Air": "double air energy heightens communication, social connection, and mental activity",
    "Air_Water": "air and water unite reason with emotion, balancing thought and feeling",
    "Water_Fire": "water and fire merge emotional intensity with passionate action",
    "Water_Earth": "water and earth combine emotional security with material stability",
    "Water_Air": "water and air blend intuitive insight with intellectual understanding",
    "Water_Water": "double water energy deepens emotional sensitivity, empathy, and psychic awareness"
  },
  "general_wisdom": [
    "The stars suggest paying attention to subtle synchronicities around you",
    "Planetary alignments favor inner reflection and personal growth",
    "Current cosmic energies support authentic self-expression",
    "The universe encourages you to trust your intuitive guidance",
    "Celestial patterns indicate a time for mindful decision-making",
    "Astrological influences remind you to balance giving and receiving",
    "The heavens point toward opportunities for meaningful connection",
    "Planetary movements suggest examining what truly matters to you",
    "Cosmic rhythms invite you to honor your natural cycles and needs",
    "The stars remind you that timing and patience work together"
  ],
  "house_daily_focus": {
    "1": "focusing on personal identity, appearance, and how you initiate new beginnings",
    "2": "highlighting your relationship with money, possessions, and personal values",
    "3": "emphasizing communication, learning, and connections with your immediate environment",
    "4": "drawing attention to home, family, and your emotional foundations",
    "5": "spotlighting creativity, romance, pleasure, and self-expression",
    "6": "bringing focus to daily routines, work, health, and acts of service",
    "7": "illuminating partnerships, relationships, and how you relate to others",
    "8": "deepening your engagement with transformation, shared resources, and intimacy",
    "9": "expanding your horizons through travel, philosophy, and higher learning",
    "10": "highlighting your career, public life, and reputation in the world",
    "11": "connecting you with friends, groups, and your hopes for the future",
    "12": "inviting introspection, spiritual practices, and engagement with the unconscious"
  },
  "compatibility": {
    "element_dynamics": {
      "Fire_Fire": "When two share this elemental nature, the temptation to move too quickly can overshadow the need for patience. Your mutual tendency toward independence may clash with desires for closeness, creating a push-pull dynamic that requires conscious navigation.",
      "Fire_Earth": "The urge to rush forward meets resistance from caution, which can feel frustrating to both parties. One person's need for excitement may seem threatening to another's desire for security, yet this very tension offers opportunities for balanced growth.",
      "Fire_Air": "Excitement builds rapidly between you, potentially creating unrealistic expectations about the relationship's trajectory. The fear that slowing down might diminish the spark can lead to avoidance of necessary deeper conversations about commitment and vulnerability.",
      "Fire_Water": "Intensity of feeling can be both exhilarating and overwhelming. One person's directness may inadvertently wound another's sensitivity, while emotional depth might feel constraining to a free spirit. Both must navigate the anxiety between pursuing passion and protecting vulnerability.",
      "Earth_Earth": "Shared caution can create safety but also stagnation. The fear of disrupting stability might prevent necessary risks in intimacy. Both parties may struggle with unexpressed needs, each waiting for the other to initiate emotional vulnerability, creating a standoff of unspoken longing.",
      "Earth_Air": "Practical concerns may clash with intellectual idealism, creating misunderstandings about priorities. One person's need for concrete proof of commitment might seem limiting to another who values freedom of thought and flexibility, leading to frustration on both sides.",
      "Earth_Water": "Deep emotional currents run beneath a stable surface, but unexpressed feelings can build into resentment. The tendency to prioritize security over emotional honesty may create distance even while maintaining the appearance of stability.",
      "Air_Air": "Mental connection flows easily, but fear of emotional intensity may keep both parties circling around deeper intimacy. The tendency to intellectualize feelings rather than experience them can create a relationship that feels more like a friendship than a passionate partnership.",
      "Air_Water": "Logic and emotion speak different languages, creating potential for misunderstanding. One person's need to process through talking may overwhelm another who needs quiet reflection. The anxiety about being truly understood can drive both parties into defensive patterns.",
      "Water_Water": "Emotional intensity reaches profound depths, but the fear of drowning in feelings can cause periodic withdrawal. Both may struggle with boundaries, leading to cycles of enmeshment and distance that leave each person feeling insecure about the relationship's stability."
    },
    "universal_relationship_patterns": [
      "Your tendency to seek reassurance may inadvertently push away the very connection you desire, creating a self-fulfilling prophecy of abandonment fears",
      "The urge to prove your worth through constant availability can lead to resentment when that effort goes unacknowledged",
      "Anxiety about the future may prevent you from fully experiencing the present moment of connection",
      "The fear of appearing too eager can cause you to withhold genuine enthusiasm, creating emotional distance",
      "Past disappointments may unconsciously influence current interactions, causing you to interpret neutral actions as rejection",
      "The desire for control over the relationship's pace can manifest as either rushing forward or holding back, both stemming from the same underlying insecurity",
      "Your need for independence conflicts with your desire for deep connection, creating internal tension that may confuse your partner",
      "The tendency to overanalyze every interaction can drain spontaneity from moments that would otherwise feel natural",
      "Fear of vulnerability may lead you to create tests or obstacles that your partner must overcome to prove their dedication",
      "The impulse to fix or improve your partner stems from your own discomfort with imperfection, potentially making them feel inadequate",
      "Difficulty expressing needs directly often results in disappointment when others fail to intuit what you want",
      "The pattern of seeking external validation for your lovability prevents you from developing inner confidence in your worth",
      "Comparing this relationship to idealized versions or past experiences blinds you to its unique possibilities",
      "The urge to merge completely with another person may sacrifice the individual identity that attracted them initially",
      "Resistance to change can keep you in a comfortable but unfulfilling dynamic rather than risk the unknown",
      "The tendency to prioritize your partner's needs over your own creates an imbalanced dynamic that breeds resentment",
      "Fear of conflict leads to avoiding difficult conversations, allowing small issues to accumulate into major problems",
      "The impulse to prove you're different from your partner's past disappoints can make you inauthentic",
      "Anxiety about commitment may cause you to focus on flaws rather than appreciating positive qualities",
      "The need to maintain mystery or emotional unavailability as a form of self-protection ultimately prevents true intimacy"
    ],
    "compatibility_advice": {
      "challenging": [
        "This connection asks you to confront the parts of yourself you usually avoid. The discomfort you feel may actually indicate growth potential rather than incompatibility.",
        "Your different approaches to life can feel threatening to your sense of self, but this friction offers opportunities to expand beyond your usual patterns.",
        "The urge to change your partner into someone more familiar to you stems from fear of the unknown. Consider whether you're avoiding necessary self-evolution.",
        "Frustration in this pairing often arises from projecting your own disowned qualities onto the other person. What you resist in them may reveal what you resist in yourself.",
        "This relationship will challenge your assumptions about how love should look. The question is whether you can embrace a different model than you've imagined."
      ],
      "harmonious": [
        "Easy compatibility can become complacent if you're not careful. The comfort you feel shouldn't prevent continued growth and discovery.",
        "The natural flow between you might create unrealistic expectations that everything should always be effortless. Remember that all relationships require conscious effort.",
        "Your similar approaches to life provide support but may also create an echo chamber. Seek out perspectives that challenge your shared assumptions.",
        "The lack of obvious friction might cause you to mistake absence of conflict for depth of connection. Ensure you're building true intimacy, not just peaceful coexistence.",
        "This harmonious energy can facilitate rapid bonding, but be wary of skipping important conversations about differences that exist beneath surface compatibility."
      ],
      "neutral": [
        "Neither particularly easy nor difficult, this pairing requires conscious choice and effort. The relationship becomes what you both decide to make of it.",
        "Your different but complementary natures mean that connection won't happen automatically. You must actively build bridges rather than expecting natural resonance.",
        "This combination lacks the fireworks of instant attraction or the friction of obvious challenge. Whether that feels disappointing or relieving reveals your relationship patterns.",
        "The neutral energy here places responsibility squarely on both individuals to create the relationship dynamic you want. There's no predetermined script to follow.",
        "Without strong astrological push in either direction, you're free to write your own story. This can feel liberating or daunting depending on your comfort with ambiguity."
      ]
    },
    "transit_influences_on_relationships": {
      "venus_retrograde": [
        "Unresolved relationship patterns from your past are surfacing for examination. The temptation to repeat familiar dynamics is strong, even when those patterns didn't serve you previously.",
        "Your perception of what you find attractive may be shifting, causing confusion about what you truly want versus what you thought you wanted.",
        "Old flames or past connections may reappear in your thoughts or reality, not necessarily to be rekindled but to offer perspective on your growth.",
        "The value you place on partnership itself is under review. Questions about whether you're seeking connection from wholeness or from a sense of lack become important."
      ],
      "mars_retrograde": [
        "Passive patterns in how you assert your needs may create frustration. The energy to pursue what you want feels internalized, requiring you to examine your motivations before acting.",
        "Anger or resentment that you've been suppressing in relationships may surface in indirect ways, demanding honest acknowledgment.",
        "Your usual approach to pursuing romantic interests feels less effective. This pause allows you to question whether your typical strategy aligns with who you're becoming.",
        "Sexual or physical chemistry may feel different than usual, potentially revealing whether your connection is built on multiple levels or primarily physical attraction."
      ],
      "mercury_retrograde": [
        "Misunderstandings arise easily from assumptions about what hasn't been explicitly stated. The importance of clear, direct communication becomes unavoidable.",
        "Technology-based connection may fail at crucial moments, forcing you to rely on in-person interaction or accept periods of silence.",
        "Past conversations or unresolved discussions resurface, offering second chances to address what was left unsaid or misunderstood.",
        "The way you've been telling yourself the story of this relationship may shift as new information or perspectives emerge, requiring you to update your narrative."
      ],
      "jupiter_expansion": [
        "Optimism about the relationship's potential can lead to overlooking practical concerns or rushing important stages of development.",
        "Generosity flows easily between you, but ensure it's reciprocal rather than one person giving excessively to maintain the other's interest.",
        "The relationship may expand into new territories—meeting families, discussing future plans, or deepening commitment—faster than you anticipated.",
        "Your vision of what's possible together grows, but beware of projecting an idealized future rather than appreciating what exists now."
      ],
      "saturn_restriction": [
        "Tests of commitment and seriousness make superficial connection difficult to maintain. The relationship must deepen or naturally conclude.",
        "Responsibilities outside the relationship may limit time and energy available for romance, revealing whether the connection can withstand real-world pressures.",
        "Fears about long-term viability surface, requiring honest assessment of whether concerns are realistic or based on old wounds.",
        "The structure of how you relate to each other may need redefinition. Rules and expectations that worked initially may require maturation."
      ],
      "uranus_disruption": [
        "Unexpected changes in circumstances or perspective can shake the relationship's foundation. Flexibility and adaptability become essential.",
        "The urge for freedom and independence intensifies, creating tension with the vulnerability that intimacy requires.",
        "Sudden insights about the relationship's true nature—positive or negative—arrive without warning, demanding honest acknowledgment.",
        "Unconventional approaches to partnership may appeal where traditional structures felt limiting, though impulsiveness should be balanced with consideration."
      ],
      "neptune_illusion": [
        "The boundary between romantic fantasy and reality blurs. What you're experiencing may be idealization rather than accurate perception of your partner.",
        "Confusion about the relationship's status or the other person's intentions persists despite attempts to clarify. Trust your instincts if something feels unclear.",
        "Compassion and empathy deepen, but be wary of sacrificing your needs to rescue or fix your partner.",
        "Spiritual or creative connection may transcend ordinary relating, offering beautiful moments while potentially avoiding practical necessities."
      ],
      "pluto_transformation": [
        "Power dynamics in the relationship surface for examination. Issues of control, manipulation, or surrender can no longer be avoided.",
        "The relationship triggers deep psychological material—wounds, fears, compulsions—that demand to be faced rather than repressed.",
        "An ending or profound transformation feels inevitable. Whether this means the relationship concludes or evolves into something new depends on both parties' willingness to change.",
        "Intensity reaches levels that feel almost unbearable. The question becomes whether you're destroying something necessary or releasing what no longer serves."
      ]
    }
  },
  "natal_chart": {
    "planet_in_sign": {
      "Sun_Aries": "Your core identity is driven by initiative, courage, and the need to pioneer new paths. You define yourself through action and leadership.",
      "Sun_Taurus": "Your essence is rooted in stability, sensuality, and the appreciation of lasting value. You define yourself through what you build and preserve.",
      "Sun_Gemini": "Your identity centers on communication, curiosity, and mental agility. You define yourself through ideas and connections.",
      "Sun_Cancer": "Your core self is nurturing, protective, and emotionally intuitive. You define yourself through care and emotional bonds.",
      "Sun_Leo": "Your essence radiates creativity, warmth, and self-expression. You define yourself through generosity and authentic presence.",
      "Sun_Virgo": "Your identity is grounded in service, analysis, and refinement. You define yourself through improvement and practical contribution.",
      "Sun_Libra": "Your core self seeks harmony, beauty, and partnership. You define yourself through relationships and aesthetic balance.",
      "Sun_Scorpio": "Your essence pulses with intensity, depth, and transformative power. You define yourself through psychological insight and regeneration.",
      "Sun_Sagittarius": "Your identity expands through exploration, philosophy, and optimism. You define yourself through seeking truth and meaning.",
      "Sun_Capricorn": "Your core self is ambitious, disciplined, and structurally minded. You define yourself through achievement and mastery.",
      "Sun_Aquarius": "Your essence is innovative, independent, and humanistic. You define yourself through originality and collective vision.",
      "Sun_Pisces": "Your identity dissolves boundaries through compassion, imagination, and spiritual connection. You define yourself through transcendence and empathy.",
      
      "Moon_Aries": "Emotionally, you need spontaneity, independence, and direct action to feel secure.",
      "Moon_Taurus": "Emotionally, you need stability, physical comfort, and predictable routines to feel secure.",
      "Moon_Gemini": "Emotionally, you need mental stimulation, variety, and communication to feel secure.",
      "Moon_Cancer": "Emotionally, you need deep nurturing, family connection, and emotional safety to feel secure.",
      "Moon_Leo": "Emotionally, you need recognition, creative expression, and heartfelt appreciation to feel secure.",
      "Moon_Virgo": "Emotionally, you need order, usefulness, and the ability to help others to feel secure.",
      "Moon_Libra": "Emotionally, you need harmony, partnership, and aesthetic beauty to feel secure.",
      "Moon_Scorpio": "Emotionally, you need depth, privacy, and intense connection to feel secure.",
      "Moon_Sagittarius": "Emotionally, you need freedom, adventure, and philosophical meaning to feel secure.",
      "Moon_Capricorn": "Emotionally, you need structure, respect, and tangible achievement to feel secure.",
      "Moon_Aquarius": "Emotionally, you need independence, intellectual freedom, and social ideals to feel secure.",
      "Moon_Pisces": "Emotionally, you need spiritual connection, creative flow, and compassionate understanding to feel secure.",
      
      "Mercury_Aries": "Your mind processes information quickly and decisively, favoring direct communication over nuance.",
      "Mercury_Taurus": "Your mind processes information slowly and thoroughly, building concrete understanding over time.",
      "Mercury_Gemini": "Your mind processes information rapidly through multiple channels, connecting diverse ideas effortlessly.",
      "Mercury_Cancer": "Your mind processes information through emotional filters, remembering feelings as much as facts.",
      "Mercury_Leo": "Your mind processes information dramatically, expressing ideas with creative flair and confidence.",
      "Mercury_Virgo": "Your mind processes information analytically, noticing details others overlook and organizing methodically.",
      "Mercury_Libra": "Your mind processes information through comparison, weighing multiple perspectives before deciding.",
      "Mercury_Scorpio": "Your mind processes information deeply, investigating beneath surface appearances to uncover hidden truths.",
      "Mercury_Sagittarius": "Your mind processes information expansively, connecting ideas to larger philosophical frameworks.",
      "Mercury_Capricorn": "Your mind processes information practically, focusing on useful applications and structural logic.",
      "Mercury_Aquarius": "Your mind processes information innovatively, making unexpected connections and valuing original thinking.",
      "Mercury_Pisces": "Your mind processes information intuitively, understanding through symbols, metaphors, and creative association.",
      
      "Venus_Aries": "You express love through passionate pursuit and bold romantic gestures, valuing excitement over stability.",
      "Venus_Taurus": "You express love through physical affection and material gestures, valuing loyalty and sensory pleasure.",
      "Venus_Gemini": "You express love through playful communication and intellectual connection, valuing variety and wit.",
      "Venus_Cancer": "You express love through nurturing care and emotional devotion, valuing security and tenderness.",
      "Venus_Leo": "You express love through generous displays and dramatic romance, valuing admiration and warmth.",
      "Venus_Virgo": "You express love through practical service and thoughtful gestures, valuing usefulness and refinement.",
      "Venus_Libra": "You express love through romantic idealism and partnership balance, valuing harmony and beauty.",
      "Venus_Scorpio": "You express love through intense intimacy and emotional depth, valuing transformation and loyalty.",
      "Venus_Sagittarius": "You express love through adventurous exploration and philosophical connection, valuing freedom and honesty.",
      "Venus_Capricorn": "You express love through committed actions and lasting bonds, valuing respect and stability.",
      "Venus_Aquarius": "You express love through friendship and intellectual rapport, valuing independence and uniqueness.",
      "Venus_Pisces": "You express love through selfless compassion and spiritual union, valuing empathy and romance.",
      
      "Mars_Aries": "You pursue goals with direct aggression and competitive drive, acting on impulse without hesitation.",
      "Mars_Taurus": "You pursue goals with steady determination and physical strength, acting methodically with endurance.",
      "Mars_Gemini": "You pursue goals with mental agility and versatile tactics, acting on ideas and communication.",
      "Mars_Cancer": "You pursue goals with emotional intensity and protective instinct, acting to defend what you nurture.",
      "Mars_Leo": "You pursue goals with creative confidence and dramatic flair, acting to express your personal power.",
      "Mars_Virgo": "You pursue goals with precise efficiency and strategic planning, acting through careful analysis.",
      "Mars_Scorpio": "You pursue goals with ruthless focus and transformative intensity, acting from deep psychological drives.",
      "Mars_Sagittarius": "You pursue goals with adventurous enthusiasm and philosophical conviction, acting on belief and optimism.",
      "Mars_Capricorn": "You pursue goals with disciplined ambition and strategic patience, acting to build lasting achievement.",
      "Mars_Aquarius": "You pursue goals with innovative rebellion and intellectual strategy, acting on principles and ideals.",
      "Mars_Pisces": "You pursue goals with intuitive flow and compassionate action, acting when emotionally or spiritually moved."
        },

    "natal_retrograde": {
      "Mercury": "Born with Mercury retrograde, you process information internally before expressing it. Your thinking style may differ from conventional patterns, offering unique insights others miss. Communication feels more natural when you've had time to reflect.",
      "Venus": "Born with Venus retrograde, you internalize questions about love and value. Relationships and self-worth develop through inner work rather than external validation. You may revisit past relationship patterns to understand what you truly desire.",
      "Mars": "Born with Mars retrograde, you direct your drive and anger inward initially. Action comes after internal processing rather than immediate reaction. You may struggle with assertiveness but develop powerful self-directed motivation.",
      "Jupiter": "Born with Jupiter retrograde, you find meaning through internal philosophy rather than external belief systems. Growth comes from questioning received wisdom and developing personal understanding of truth.",
      "Saturn": "Born with Saturn retrograde, you internalize authority and discipline. Self-criticism may be stronger than external judgment. You build structures through inner work, often achieving mastery later in life.",
      "Uranus": "Born with Uranus retrograde, rebellion and innovation happen internally first. You may feel like an outsider but develop unique perspectives that eventually revolutionize your personal world.",
      "Neptune": "Born with Neptune retrograde, spiritual connection flows inward. Dreams and intuition are personal rather than collective. You may feel disconnected from mass illusions, seeing through them clearly.",
      "Pluto": "Born with Pluto retrograde, transformation operates primarily within. You process power dynamics and psychological depths internally, emerging with profound self-knowledge."
    },
    
    "aspects": {
      "conjunction": {
        "description": "When planets align within 8 degrees, their energies merge and amplify each other.",
        "interpretation": "These planets work as a unified force in your life, their qualities inseparable and intensified."
      },
      "opposition": {
        "description": "When planets sit 180 degrees apart (±8°), they create tension between opposing needs.",
        "interpretation": "You experience these planetary energies as internal or external conflict requiring integration and balance."
      },
      "trine": {
        "description": "When planets form a 120-degree angle (±8°), their energies flow harmoniously.",
        "interpretation": "These planetary qualities support each other naturally, creating talent and ease in related areas."
      },
      "square": {
        "description": "When planets form a 90-degree angle (±8°), they create friction and dynamic tension.",
        "interpretation": "These planetary energies clash, creating challenges that drive growth and development through struggle."
      },
      "sextile": {
        "description": "When planets form a 60-degree angle (±6°), they offer cooperative potential.",
        "interpretation": "These planetary qualities work well together when consciously activated, offering opportunities for creative problem-solving."
      }
    },
    
    "rising_sign": {
      "Aries": "You approach life with direct energy and competitive spirit. Others see you as bold, sometimes impulsive, but always authentic in your immediate reactions.",
      "Taurus": "You approach life with calm steadiness and sensory awareness. Others see you as grounded, reliable, and appreciative of quality and comfort.",
      "Gemini": "You approach life with curiosity and communicative openness. Others see you as quick-witted, versatile, and intellectually engaging.",
      "Cancer": "You approach life with emotional sensitivity and protective caution. Others see you as nurturing, empathetic, and sometimes guarded.",
      "Leo": "You approach life with creative confidence and generous warmth. Others see you as magnetic, dramatic, and radiating self-assurance.",
      "Virgo": "You approach life with analytical precision and helpful service. Others see you as detailed-oriented, modest, and practically competent.",
      "Libra": "You approach life with diplomatic grace and aesthetic awareness. Others see you as charming, fair-minded, and socially skilled.",
      "Scorpio": "You approach life with intense focus and emotional depth. Others see you as powerful, mysterious, and psychologically penetrating.",
      "Sagittarius": "You approach life with optimistic exploration and philosophical openness. Others see you as adventurous, honest, and expansively minded.",
      "Capricorn": "You approach life with disciplined ambition and strategic reserve. Others see you as mature, responsible, and goal-oriented.",
      "Aquarius": "You approach life with innovative independence and humanitarian ideals. Others see you as original, unconventional, and intellectually principled.",
      "Pisces": "You approach life with compassionate sensitivity and creative imagination. Others see you as empathetic, spiritual, and artistically inclined."
    },

    "aspect_interpretations": {
      "Sun_Moon": {
        "conjunction": "Your conscious identity and emotional nature are unified. What you want and what you need align naturally, creating inner coherence. Throughout your life, you've likely found it easier than most to understand yourself, though you may lack the perspective that comes from internal tension.",
        "opposition": "You were born with tension between your will and your needs. What your ego wants often conflicts with what makes you feel secure. This has manifested as external conflicts with authority figures or internal battles between reason and emotion. Over time, you develop the ability to integrate these opposing forces, becoming a bridge between different perspectives.",
        "trine": "You have natural ease between your conscious purpose and emotional instincts. Self-expression flows effortlessly, and you've likely experienced support from both father and mother figures. Your challenge is ensuring this ease doesn't breed complacency—your talent for harmony should be actively developed rather than taken for granted.",
        "square": "Your identity and emotional needs create dynamic tension. You've struggled with feeling torn between what you should do and what you need. This friction has been uncomfortable but generative, forcing you to develop self-awareness through conflict. As you mature, this tension becomes the engine of your growth.",
        "sextile": "Your will and emotions cooperate when consciously activated. You have latent talent for emotional intelligence and self-awareness, but must actively develop these gifts. Opportunities to integrate head and heart appear throughout your life, requiring your initiative to manifest."
      },
      
      "Sun_Mercury": {
        "conjunction": "Your identity and communication are inseparable—you are what you think and say. Self-expression through words or ideas feels natural, though you may struggle to see perspectives beyond your own. Your mind and ego merge, making you articulate about who you are but potentially blind to how you think.",
        "sextile": "When you engage your mind, you express yourself clearly and authentically. Writing, speaking, or intellectual pursuits align naturally with your sense of self when you make the effort. Your thoughts enhance your identity when consciously developed."
      },
      
      "Sun_Venus": {
        "conjunction": "Your sense of self is deeply connected to beauty, relationships, and what you value. You likely possess natural charm and creative talent. Love and self-worth are intertwined—when relationships go well, you feel strong; when they suffer, your identity wavers. Learning to value yourself independent of others is your journey.",
        "sextile": "You have latent artistic ability and social grace that enhance your identity when developed. Creative pursuits and relationships support your sense of self when you actively engage them. Beauty and harmony are tools available to strengthen who you are."
      },
      
      "Sun_Mars": {
        "conjunction": "Your will and drive are one. You act decisively and identify strongly with your ability to take action. Aggression and assertion feel natural, though you may struggle with patience. Throughout life, you've been the initiator, the warrior, the one who moves first. Your challenge is learning when not to act.",
        "opposition": "You were born with your will facing opposition. What you want provokes resistance, either from external forces or internal sabotage. This has taught you about power dynamics and the art of strategic assertion. Relationships may feel like battles until you learn to integrate cooperation with your natural combativeness.",
        "trine": "Physical energy and willpower flow naturally to support your goals. You've likely found success through direct action and maintain good vitality. Your challenge is ensuring this ease doesn't make you insensitive to those who must struggle more for what you achieve effortlessly.",
        "square": "Your will and drive create internal or external friction. You've experienced frustration when trying to assert yourself, leading to either repressed anger or excessive aggression. This tension has forced you to develop mastery over your impulses and strategic thinking about when and how to act.",
        "sextile": "When you consciously direct your energy, you accomplish your goals effectively. Physical activity, assertiveness training, or competitive pursuits enhance your sense of self when you engage them intentionally."
      },
      
      "Sun_Jupiter": {
        "conjunction": "Your identity expands naturally. Optimism, generosity, and faith in yourself come easily. You may have been told you're 'lucky,' though this is really confidence creating opportunity. Your challenge is avoiding inflation—believing your own hype can lead to overextension. When grounded, your expansive nature inspires others.",
        "opposition": "Your sense of self conflicts with your beliefs and aspirations. What you are tensions against what you believe you should become. This has manifested as philosophical crises or conflicts between personal needs and ethical ideals. Integration comes through recognizing that who you are and what you believe must align.",
        "trine": "Growth and opportunity flow naturally to you. You've experienced fortunate timing and helpful mentors throughout life. Education, travel, and philosophical pursuits enhance your identity effortlessly. Your challenge is using these gifts purposefully rather than squandering natural advantages.",
        "square": "Your growth requires overcoming obstacles. Expansion feels difficult—either blocked by external circumstances or internal doubt. This friction has taught you that meaning must be earned, not assumed. Your hard-won wisdom runs deeper than those who received easy answers.",
        "sextile": "Educational, philosophical, or travel opportunities enhance your identity when you actively pursue them. Growth is available but requires your initiative to manifest."
      },
      
      "Sun_Saturn": {
        "conjunction": "Your identity formed under pressure. Responsibility, limitation, or authority figures shaped who you became. You take yourself seriously, perhaps too seriously. Maturity came early, possibly through hardship. Your gift is endurance; your challenge is allowing lightness and spontaneity.",
        "opposition": "You were born facing authority. Father figures, society, or your own harsh self-judgment have opposed your self-expression. This external or internal restriction has forced you to earn your right to exist. As you mature, you become your own authority, no longer requiring external validation.",
        "trine": "Discipline and structure support your identity naturally. You've maintained good boundaries and realistic self-assessment. Time has been your friend—aging likely brings increased respect and achievement. Your challenge is ensuring your natural conservatism doesn't prevent necessary risks.",
        "square": "Your identity development faced obstacles. Self-expression met criticism or restriction, teaching you that becoming yourself requires persistent effort. Feelings of inadequacy have driven you to achieve, but also created harsh self-judgment. Integration comes through self-compassion while maintaining discipline.",
        "sextile": "When you apply discipline and structure, you strengthen your identity. Career achievement, time management, or taking on responsibility enhances who you are when consciously pursued."
      },
      
      "Sun_Uranus": {
        "conjunction": "You are fundamentally different. Rebellion, innovation, and independence define your identity. You've never fit conventional molds and have likely experienced both the freedom and loneliness of being unique. Your authenticity is revolutionary, though maintaining relationships while being yourself requires conscious effort.",
        "opposition": "Your identity provokes disruption. Who you are challenges others or society challenges who you're becoming. Sudden changes have shaped your life—unexpected events forcing you to become more authentically yourself. Relationships feel unstable until you find partners who celebrate rather than fear your uniqueness.",
        "trine": "Innovation and independence enhance your identity naturally. You've maintained authenticity without excessive rebellion. Change comes easily and you adapt to new situations gracefully. Your challenge is using your progressive nature to benefit others, not just yourself.",
        "square": "Becoming yourself required breaking patterns. Your authenticity has been disrupted by external forces or internal chaos. This tension has forced you to fight for the right to be different. Your originality was hard-won through repeated upheaval.",
        "sextile": "When you embrace innovation and independence, you enhance your identity. Technology, progressive movements, or unconventional pursuits strengthen who you are when actively engaged."
      },
      
      "Sun_Neptune": {
        "conjunction": "Your identity dissolves boundaries. Who you are merges with imagination, spirituality, or illusion. You may struggle with a clear sense of self—either through confusion about who you are or transcendent experiences that reveal the ego as construct. Your gift is compassion and creativity; your challenge is maintaining healthy boundaries.",
        "opposition": "Your sense of self conflicts with idealism or illusion. What you are tensions against what you imagine or what others project onto you. This has manifested as identity confusion or disillusionment when reality fails to match dreams. Integration comes through grounding your visions in authentic self-knowledge.",
        "trine": "Imagination and spirituality support your identity naturally. Creative or mystical pursuits enhance who you are effortlessly. You've likely experienced fortunate dissolving of ego boundaries—through art, meditation, or love—that expanded your sense of self. Your challenge is maintaining groundedness.",
        "square": "Your identity formation involved confusion or deception. Who you are has been obscured by illusions—either self-created fantasies or projections from others. This difficult relationship with reality has forced you to develop discernment between truth and wishful thinking.",
        "sextile": "When you engage creativity or spirituality, you enhance your identity. Artistic pursuits, meditation, or compassionate service strengthen who you are when consciously developed."
      },
      
      "Sun_Pluto": {
        "conjunction": "Your identity is intense and transformative. Power dynamics, death and rebirth, and psychological depth define your self-concept. You've likely experienced profound transformations that destroyed and remade who you are. Your presence is magnetic but potentially overwhelming. Learning to wield power responsibly is your life's work.",
        "opposition": "Your sense of self faces intense external pressure. Power struggles with authority figures or transformative crises have forced you to confront who you really are beneath social masks. This has been traumatic but ultimately empowering—you cannot be destroyed because you've already been through fire.",
        "trine": "Transformation and psychological insight enhance your identity naturally. You've processed difficult experiences and emerged stronger. Crisis situations reveal your strength. Your challenge is using your natural intensity to empower others, not dominate them.",
        "square": "Your identity development involved power struggles. Becoming yourself required confronting forces—internal or external—that sought to control or suppress you. This painful friction has given you profound self-knowledge and the ability to help others through their own transformations.",
        "sextile": "When you engage with depth psychology, crisis situations, or transformation processes, you strengthen your identity. Therapy, shadow work, or empowering others enhances who you are when actively pursued."
      },
      
      "Moon_Mercury": {
        "conjunction": "Your emotions and thoughts merge. You process feelings through analysis and think emotionally. This creates eloquence about inner experience but potential difficulty separating feeling from fact. You need to talk about your feelings and may overthink emotional situations.",
        "opposition": "Your emotional needs conflict with your rational mind. What you feel tensions against what you think. This has created internal debates between heart and head. Integration comes through valuing both emotional truth and logical analysis.",
        "trine": "Your emotions and intellect support each other naturally. You articulate feelings clearly and understand emotions intellectually. Journaling or talking through feelings comes easily. Your emotional intelligence is a natural gift.",
        "square": "Your feelings and thoughts create friction. Emotional reactions interfere with clear thinking or excessive analysis blocks authentic feeling. This tension has forced you to develop sophisticated emotional intelligence through struggle.",
        "sextile": "When you apply intellect to emotions, you gain valuable self-understanding. Writing, therapy, or emotional analysis enhances your wellbeing when actively pursued."
      },
      
      "Moon_Venus": {
        "conjunction": "Your emotional needs and capacity for love merge. You need beauty, harmony, and affection to feel secure. Relationships are essential to your wellbeing. Artistic expression may come naturally as a way to process feelings.",
        "opposition": "Your emotional security conflicts with relationship needs. What makes you feel safe tensions against what love requires. This has created patterns of choosing between self-care and partnership. Integration comes through relationships that honor your emotional truth.",
        "trine": "Love and emotional security support each other naturally in your life. You've likely experienced nurturing relationships and possess natural grace. Beauty and harmony enhance your emotional wellbeing effortlessly.",
        "square": "Your need for security conflicts with your need for love. Emotional safety and relationship happiness have felt mutually exclusive. This friction has forced you to develop capacity for both intimacy and independence.",
        "sextile": "When you engage creativity or seek beautiful environments, your emotional wellbeing improves. Artistic pursuits or cultivating harmonious relationships enhances your security when consciously developed."
      },
      
      "Moon_Mars": {
        "conjunction": "Your emotions and anger merge. You feel intensely and react quickly. Emotional security requires the freedom to assert yourself. You may have learned to suppress reactive emotions or struggle with emotional volatility. Integration comes through healthy expression of emotional needs.",
        "opposition": "Your emotional needs face aggressive opposition. What makes you feel safe provokes conflict or your anger threatens your security. This has taught painful lessons about assertion versus aggression. Integration requires finding safe ways to express emotional intensity.",
        "trine": "Emotional expression and assertiveness flow naturally together. You defend your feelings effectively and maintain good emotional boundaries. Your emotional honesty and directness are gifts when used consciously.",
        "square": "Your emotions and drive create internal conflict. Anger may threaten emotional security or emotional needs block necessary action. This friction has forced you to develop mastery over reactive impulses.",
        "sextile": "When you assert emotional boundaries or engage physical activity, your emotional wellbeing improves. Exercise or healthy confrontation enhances your security when actively pursued."
      },
      
      "Moon_Jupiter": {
        "conjunction": "Your emotional nature is expansive and optimistic. You need growth, meaning, and generosity to feel secure. Emotional abundance comes naturally but can lead to emotional excess—overgiving or emotional inflation.",
        "opposition": "Your emotional security conflicts with your need for expansion. What makes you feel safe tensions against your desire for growth. This has created patterns of choosing between comfort and adventure. Integration comes through finding emotional security in the journey itself.",
        "trine": "Optimism and emotional wellbeing support each other naturally. You've maintained emotional resilience and faith in life. Philosophical or spiritual pursuits enhance your emotional security effortlessly.",
        "square": "Your emotional needs conflict with your aspirations. Security and growth feel mutually exclusive. This friction has forced you to develop emotional wisdom through confronting where safety ends and stagnation begins.",
        "sextile": "When you engage philosophical exploration or generous activities, your emotional wellbeing improves. Travel, education, or giving to others enhances your security when consciously pursued."
      },
      
      "Moon_Saturn": {
        "conjunction": "Your emotional nature is serious and disciplined. You may have experienced emotional restriction in childhood, learning to be responsible for your feelings. Emotional security comes through structure, achievement, and self-control. Your challenge is allowing vulnerability.",
        "opposition": "Your emotional needs face restriction. What makes you feel safe is opposed by responsibility, criticism, or limitation. This has taught painful lessons about emotional self-sufficiency. Integration comes through self-compassion while maintaining maturity.",
        "trine": "Emotional discipline and security support each other naturally. You maintain good emotional boundaries and realistic expectations. Time has been kind to your emotional development. Your challenge is ensuring emotional self-control doesn't become emotional suppression.",
        "square": "Your emotional needs and sense of responsibility conflict. Feelings have been criticized, restricted, or deemed inappropriate. This friction has forced you to develop emotional resilience while learning to honor vulnerable feelings.",
        "sextile": "When you apply structure to emotional life, your wellbeing improves. Creating routines, setting boundaries, or taking emotional responsibility enhances your security when actively pursued."
      },
      
      "Moon_Uranus": {
        "conjunction": "Your emotional nature is unpredictable and independent. You need freedom and excitement to feel secure—a paradoxical need for security through instability. Emotional expression is authentic but potentially disruptive. Conventional emotional patterns feel constraining.",
        "opposition": "Your emotional security faces disruption. What makes you feel safe is challenged by sudden change or need for independence. This has created tension between stability and freedom. Integration comes through finding security in adaptability itself.",
        "trine": "Independence and emotional security coexist naturally. You maintain emotional authenticity without excessive rebellion. Change enhances rather than threatens your wellbeing. Your emotional uniqueness is a gift.",
        "square": "Your emotional needs conflict with your need for freedom. Security and independence feel mutually exclusive. This friction has forced you to develop capacity for both emotional connection and autonomous individuality.",
        "sextile": "When you embrace change or assert independence, your emotional wellbeing improves. Trying new experiences or honoring your uniqueness enhances your security when actively pursued."
      },
      
      "Moon_Neptune": {
        "conjunction": "Your emotional nature is boundaryless and empathic. You absorb others' feelings and may struggle to distinguish your emotions from theirs. Spiritual or creative pursuits provide emotional fulfillment. Your challenge is maintaining healthy emotional boundaries while honoring your gift for compassion.",
        "opposition": "Your emotional needs conflict with your idealism. What makes you feel secure tensions against your dreams or compassion for others. This has created patterns of sacrificing emotional wellbeing for others or disillusionment when reality fails to match fantasies. Integration comes through grounded compassion.",
        "trine": "Imagination and emotional security support each other naturally. Creative or spiritual pursuits enhance your wellbeing effortlessly. Your emotional sensitivity is a gift that flows without overwhelming you.",
        "square": "Your emotional needs conflict with your ideals. Security and compassion feel mutually exclusive or emotional clarity is obscured by fantasy. This friction has forced you to develop discernment about emotional truth versus illusion.",
        "sextile": "When you engage creativity or spiritual practices, your emotional wellbeing improves. Artistic expression, meditation, or compassionate service enhances your security when actively pursued."
      },
      
      "Moon_Pluto": {
        "conjunction": "Your emotional nature is intense and transformative. You feel deeply and may experience emotions as overwhelming or dangerous. Emotional security requires confronting shadow material and accepting your power. Your feelings have the capacity to transform both yourself and others.",
        "opposition": "Your emotional needs face intense pressure. What makes you feel secure is challenged by power dynamics, crisis, or deep psychological material. This has forced you to confront emotional depths most avoid. Integration comes through accepting your emotional intensity as strength.",
        "trine": "Emotional depth and security support each other naturally. You process difficult feelings effectively and emerge stronger from emotional crises. Your capacity for emotional transformation is a natural gift.",
        "square": "Your emotional needs conflict with power dynamics. Security and control feel mutually exclusive or deep feelings threaten emotional stability. This friction has forced you to develop mastery over intense emotional states.",
        "sextile": "When you engage depth work or face emotional intensity, your wellbeing improves. Therapy, shadow work, or transformative experiences enhance your security when actively pursued."
      },
      
      "Mercury_Venus": {
        "conjunction": "Your thinking and aesthetic sense merge. You think about beauty, relationships, and harmony. Communication is charming and diplomatic. You may possess talent for writing about love or creating beautiful language.",
        "sextile": "When you apply intellect to relationships or beauty, insights emerge. Writing, discussing aesthetics, or thinking through relationship dynamics enhances your life when consciously pursued."
      },
      
      "Mercury_Mars": {
        "conjunction": "Your mind is sharp and aggressive. You think quickly, speak directly, and may argue for sport. Mental energy is high but patience for slow thinking is low. Your challenge is tempering intellectual aggression with consideration.",
        "opposition": "Your thinking faces aggressive challenge. Your ideas provoke conflict or anger interferes with clear thought. This has taught you to defend your positions effectively while learning when combat is necessary.",
        "trine": "Mental energy and clear thinking support each other naturally. You make decisions quickly and communicate assertively without excessive aggression. Your mental sharpness is a natural gift.",
        "square": "Your thoughts and drive conflict. Anger disrupts clear thinking or mental analysis blocks necessary action. This friction has forced you to develop capacity for both strategic thought and decisive action.",
        "sextile": "When you apply mental energy to problem-solving or engage debate, your thinking sharpens. Intellectual competition or assertive communication enhances your cognition when actively pursued."
      },
      
      "Mercury_Jupiter": {
        "conjunction": "Your mind expands naturally. You think big, see patterns, and connect ideas to larger frameworks. Optimism colors your thinking—you see possibilities but may overlook practical limitations. Teaching or philosophical writing may come naturally.",
        "opposition": "Your practical thinking conflicts with expansive vision. Details and big picture tension against each other. This has taught you to balance analysis with synthesis, though the two still feel opposed.",
        "trine": "Broad thinking and practical intellect support each other naturally. You see both forest and trees effortlessly. Educational pursuits or philosophical exploration enhance your mind naturally.",
        "square": "Your thinking and beliefs conflict. Practical analysis clashes with philosophical conviction or expansive thinking ignores necessary details. This friction has forced you to develop capacity for both precision and vision.",
        "sextile": "When you engage broad study or philosophical thinking, your intellect expands. Education, travel, or connecting ideas to larger meaning enhances your mind when actively pursued."
      },
      
      "Mercury_Saturn": {
        "conjunction": "Your mind is serious and disciplined. You think carefully, speak precisely, and may be pessimistic in analysis. Mental work requires effort but produces lasting results. Your challenge is allowing spontaneous or playful thinking.",
        "opposition": "Your thinking faces criticism or restriction. Ideas are opposed by authority or harsh self-judgment makes thinking difficult. This has taught you to build mental discipline while learning not to censor too harshly.",
        "trine": "Mental discipline and clear thinking support each other naturally. You organize thoughts effectively and communicate with authority. Time improves your thinking—you grow wiser with age.",
        "square": "Your thinking and sense of limitation conflict. Mental expression has been criticized or negative thinking restricts possibilities. This friction has forced you to develop realistic thinking while not surrendering to pessimism.",
        "sextile": "When you apply structure to thinking, your mind strengthens. Systematic study, careful planning, or disciplined writing enhances your intellect when actively pursued."
      },
      
      "Mercury_Uranus": {
        "conjunction": "Your mind is innovative and unconventional. You think originally, make unexpected connections, and may have genius-level insights. Your challenge is communicating radical ideas in ways others can understand.",
        "opposition": "Your thinking is disrupted by sudden insights or rebellious ideas. Conventional thought and innovation tension against each other. This has taught you to balance tradition and originality.",
        "trine": "Original thinking and clear communication support each other naturally. Insights come easily and you express innovation without excessive chaos. Your mental uniqueness is a gift.",
        "square": "Your thinking and need for innovation conflict. Original ideas disrupt clear thought or mental chaos prevents useful conclusions. This friction has forced you to develop capacity for both creativity and coherence.",
        "sextile": "When you embrace unconventional thinking, your intellect expands. Technology, progressive ideas, or innovative problem-solving enhances your mind when actively pursued."
      },
      
      "Mercury_Neptune": {
        "conjunction": "Your mind is imaginative and intuitive. You think in symbols, images, and metaphors. Logical precision is difficult but creative or spiritual thinking flows naturally. Your challenge is distinguishing inspiration from confusion.",
        "opposition": "Your rational mind conflicts with imagination. Logic and intuition tension against each other. This has taught you that different kinds of knowing serve different purposes.",
        "trine": "Imagination and clear thinking support each other naturally. You articulate intuitive insights and understand spiritual concepts intellectually. Your capacity to translate between logic and mystery is a gift.",
        "square": "Your thinking and imagination conflict. Confusion clouds analysis or excessive rationality blocks intuitive knowing. This friction has forced you to develop capacity for both logical thought and mystical understanding.",
        "sextile": "When you engage creative or spiritual thinking, insights emerge. Artistic pursuits, meditation, or symbolic interpretation enhances your intellect when actively pursued."
      },
      
      "Mercury_Pluto": {
        "conjunction": "Your mind penetrates deeply. You think psychologically, see hidden motives, and may be obsessed with understanding truth beneath surface appearances. Your mental intensity can be overwhelming to others. Your challenge is using insight to empower rather than manipulate.",
        "opposition": "Your thinking faces intense challenge. Ideas are met with power struggles or mental obsession disrupts clear thought. This has taught you about the power dynamics of knowledge and the responsibility of insight.",
        "trine": "Deep thinking and mental clarity support each other naturally. You research effectively, understand complex psychological dynamics, and see through deception easily. Your mental depth is a gift.",
        "square": "Your thinking and power dynamics conflict. Mental obsession blocks clear analysis or insight provokes power struggles. This friction has forced you to develop mastery over your own mind.",
        "sextile": "When you engage deep research or psychological analysis, your understanding grows. Investigating hidden truths or studying transformation enhances your intellect when actively pursued."
      },
      
      "Venus_Mars": {
        "conjunction": "Your capacity for love and assertion merge. You pursue what you want romantically with direct energy. Sexual and romantic energy flow naturally together. Your challenge is balancing pursuit with receptivity.",
        "opposition": "Your need for harmony conflicts with your drive. What love requires tensions against what action demands. This has taught you about the balance between aggression and cooperation in relationships.",
        "trine": "Love and drive support each other naturally. You pursue relationships effectively and maintain passionate connections. Your romantic confidence is a gift.",
        "square": "Your capacity for love and your drive conflict. Passion becomes aggression or pursuit disrupts harmony. This friction has forced you to develop capacity for both assertiveness and diplomacy in love.",
        "sextile": "When you assert yourself in relationships, connections deepen. Direct communication or passionate pursuit enhances love when actively practiced."
      },
      
      "Venus_Jupiter": {
        "conjunction": "Your capacity for love expands naturally. You give generously and believe in abundance. Relationships and creativity flow easily but may involve excess—overgiving, overindulgence, or inflated expectations.",
        "opposition": "Your need for love conflicts with your need for freedom. Intimacy and expansion tension against each other. This has taught you about the balance between commitment and growth.",
        "trine": "Love and growth support each other naturally. Relationships expand your world and opportunities enhance your capacity for connection. Your generosity in love is a gift.",
        "square": "Your capacity for love and your aspirations conflict. Relationships feel limiting or growth disrupts connections. This friction has forced you to develop capacity for both intimacy and expansion.",
        "sextile": "When you bring optimism to relationships, connections deepen. Generosity, philosophical exploration with partners, or growing through love enhances life when actively pursued."
      },
      
      "Venus_Saturn": {
        "conjunction": "Your capacity for love is serious and mature. You take relationships seriously, possibly too seriously. Commitment comes naturally but spontaneity in love requires effort. Your challenge is allowing lightness into intimate connections.",
        "opposition": "Your need for love faces restriction. Relationships are met with obstacles, criticism, or responsibility. This has taught painful lessons about earning love and the maturity required for lasting connection.",
        "trine": "Love and responsibility support each other naturally. You maintain committed relationships and realistic expectations. Time deepens your capacity for connection. Your loyalty is a gift.",
        "square": "Your capacity for love and your limitations conflict. Relationships feel restricted or fear blocks intimate connection. This friction has forced you to develop capacity for both commitment and vulnerability.",
        "sextile": "When you bring maturity to relationships, connections deepen. Taking responsibility, honoring commitments, or building lasting partnerships enhances love when actively pursued."
      },
      
      "Venus_Uranus": {
        "conjunction": "Your capacity for love is unconventional and free. You need independence in relationships and attract unusual partners. Traditional romance feels constraining. Your challenge is maintaining connection while honoring your need for freedom.",
        "opposition": "Your need for love conflicts with your need for independence. Intimacy and freedom tension against each other. This has created unstable relationship patterns until you learn to integrate both needs.",
        "trine": "Love and independence support each other naturally. You maintain authentic relationships without excessive rebellion. Your unique approach to connection is a gift.",
        "square": "Your capacity for love and your need for freedom conflict. Relationships feel constraining or independence prevents intimacy. This friction has forced you to develop capacity for both connection and autonomy.",
        "sextile": "When you honor uniqueness in relationships, connections deepen. Unconventional partnerships or maintaining independence within intimacy enhances love when actively practiced."
      },
      
      "Venus_Neptune": {
        "conjunction": "Your capacity for love is boundaryless and idealistic. You seek spiritual union and may fall in love with potential rather than reality. Romantic illusions come naturally. Your challenge is seeing partners clearly while honoring your capacity for transcendent love.",
        "opposition": "Your need for love conflicts with your ideals. Reality disappoints romantic fantasies or compassion for others sacrifices your needs. This has taught you about the difference between love and rescuing.",
        "trine": "Love and spirituality support each other naturally. You experience transcendent connection and creative romance flows effortlessly. Your capacity for unconditional love is a gift.",
        "square": "Your capacity for love and your ideals conflict. Illusion clouds relationships or harsh reality shatters romantic dreams. This friction has forced you to develop capacity for both transcendent love and clear-eyed reality.",
        "sextile": "When you bring spirituality to relationships, connections deepen. Creative romance, compassionate love, or artistic expression enhances intimacy when actively pursued."
      },
      
      "Venus_Pluto": {
        "conjunction": "Your capacity for love is intense and transformative. You seek profound connection and experience relationships as psychologically deep. Love and power merge—you may struggle with possessiveness or attract power dynamics. Your challenge is using intensity to transform rather than control.",
        "opposition": "Your need for love faces intense pressure. Relationships involve power struggles or transformation disrupts connection. This has taught you about the shadow side of intimacy and the responsibility of emotional intensity.",
        "trine": "Love and transformation support each other naturally. You form deep bonds and process relationship challenges effectively. Your capacity for profound intimacy is a gift.",
        "square": "Your capacity for love and power dynamics conflict. Intensity threatens connection or control masquerades as love. This friction has forced you to develop capacity for both depth and healthy boundaries.",
        "sextile": "When you embrace emotional depth in relationships, connections transform. Psychological insight, shadow work with partners, or empowering love enhances intimacy when actively pursued."
      },
      
      "Mars_Jupiter": {
        "conjunction": "Your drive expands naturally. You take bold action and believe in your ability to achieve. Energy is abundant but may lead to overextension—doing too much or taking excessive risks.",
        "opposition": "Your drive conflicts with your beliefs. Action and philosophy tension against each other. This has taught you about aligning what you do with what you believe.",
        "trine": "Drive and optimism support each other naturally. You pursue goals with confidence and energy serves your aspirations effortlessly. Your entrepreneurial spirit is a gift.",
        "square": "Your drive and your beliefs conflict. Action contradicts philosophy or aspirations block necessary steps. This friction has forced you to develop integrity between what you do and what you believe.",
        "sextile": "When you align action with belief, success follows. Adventurous pursuits or goal-oriented philosophy enhances achievement when actively practiced."
      },
      
      "Mars_Saturn": {
        "conjunction": "Your drive is disciplined and strategic. You act with patience and plan carefully. Energy is controlled, possibly too controlled. Your challenge is allowing spontaneous action alongside strategic planning.",
        "opposition": "Your drive faces restriction. Action is met with obstacles or responsibility limits initiative. This has taught painful lessons about earning achievement and the discipline required for lasting success.",
        "trine": "Drive and discipline support each other naturally. You pursue goals strategically and maintain sustained effort. Time rewards your persistence. Your endurance is a gift.",
        "square": "Your drive and your limitations conflict. Action feels restricted or frustration builds from delayed gratification. This friction has forced you to develop mastery over impulse and strategic thinking.",
        "sextile": "When you apply discipline to action, achievement follows. Strategic planning, sustained effort, or patient pursuit enhances success when actively practiced."
      },
      
      "Mars_Uranus": {
        "conjunction": "Your drive is explosive and innovative. You act suddenly, rebel naturally, and may have breakthrough energy followed by burnout. Your challenge is channeling erratic energy productively.",
        "opposition": "Your drive is disrupted unpredictably. Action provokes unexpected responses or sudden urges interfere with sustained effort. This has taught you to adapt quickly and expect the unexpected.",
        "trine": "Drive and innovation support each other naturally. You act on original ideas and adapt quickly to changing circumstances. Your entrepreneurial independence is a gift.",
        "square": "Your drive and need for freedom conflict. Impulsive action disrupts goals or restriction triggers rebellion. This friction has forced you to develop capacity for both discipline and spontaneity.",
        "sextile": "When you embrace innovative action, breakthroughs occur. Trying new approaches or honoring impulses enhances achievement when actively practiced."
      },
      
      "Mars_Neptune": {
        "conjunction": "Your drive dissolves into spirit. You act on inspiration, compassion, or creative vision. Direct aggression feels wrong but passive-aggression may be a problem. Your challenge is asserting yourself while honoring spiritual values.",
        "opposition": "Your drive conflicts with your ideals. Action seems unspiritual or compassion blocks necessary assertion. This has taught you about the balance between being and doing.",
        "trine": "Drive and spirituality support each other naturally. You act on inspiration and pursue goals compassionately. Your ability to combine action with grace is a gift.",
        "square": "Your drive and your ideals conflict. Action feels tainted or confusion blocks clear initiative. This friction has forced you to develop capacity for both decisive action and spiritual surrender.",
        "sextile": "When you act on inspiration, manifestation follows. Creative pursuits, compassionate action, or spiritual practices enhance achievement when actively practiced."
      },
      
      "Mars_Pluto": {
        "conjunction": "Your drive is intensely powerful. You pursue goals with ruthless focus and possess tremendous willpower. Energy is transformative but potentially destructive. Your challenge is using power to empower rather than dominate.",
        "opposition": "Your drive faces intense opposition. Action provokes power struggles or internal compulsion battles conscious will. This has taught you about the responsible use of power and the necessity of strategic restraint.",
        "trine": "Drive and transformation support each other naturally. You pursue goals with focus and overcome obstacles through sheer will. Your capacity to regenerate energy is a gift.",
        "square": "Your drive and power dynamics conflict. Compulsive action battles conscious control or assertion provokes intense resistance. This friction has forced you to develop mastery over primal drives.",
        "sextile": "When you apply focused intensity to goals, transformation occurs. Psychological work on drive, powerful assertion, or crisis action enhances achievement when actively practiced."      }
    },
    
    "chart_patterns": {
      "grand_trine": {
        "description": "Three planets form a perfect triangle (120° apart), creating a circuit of flowing energy.",
        "interpretation": "You possess natural talent and ease in these areas. This gift flows so naturally you may take it for granted. The challenge is actively developing this innate ability rather than coasting on natural advantage. When consciously directed, this pattern becomes a source of profound creative power."
      },
      "grand_cross": {
        "description": "Four planets form a cross pattern (two oppositions squared to each other), creating maximum tension.",
        "interpretation": "You face intense, ongoing challenges that require constant navigation. Life has felt like a battleground where opposing forces demand impossible compromises. This is the aspect pattern of those who achieve mastery through struggle—your obstacles are your curriculum. Integration comes through developing the center point where all forces balance."
      },
      "t_square": {
        "description": "Three planets form a T-shape (two planets oppose each other, both square a third planet at the apex).",
        "interpretation": "You experience focused, dynamic tension driving you toward the apex planet. This creates frustration but also tremendous motivation for achievement. The empty leg (opposite the apex) indicates where you must develop capacity to release tension. This pattern belongs to driven individuals who accomplish much through channeling internal pressure."
      },
      "stellium": {
        "description": "Three or more planets clustered in the same sign or house, concentrating energy.",
        "interpretation": "You have intense focus and specialized talent in this area, but potential blind spots elsewhere. This concentration creates expertise but also imbalance—you see everything through this lens. Your challenge is developing other life areas while honoring where your power naturally concentrates."
      },
      "yod": {
        "description": "Two planets sextile each other, both quincunx (150°) a third planet at the apex—the 'Finger of God'.",
        "interpretation": "You have a fated mission or special purpose focused through the apex planet. This pattern creates a sense of destiny or being pointed toward something specific. The quincunx aspects create constant adjustment and refinement. Your life has likely featured synchronicities guiding you toward your unique calling."
      },
      "kite": {
        "description": "A Grand Trine with a fourth planet opposing one point and sextile the other two.",
        "interpretation": "You have natural talent (the trine) grounded by real-world application (the opposition). This pattern provides both ease and motivation—the kite flies because of the tension in the string. Your gifts manifest practically rather than remaining latent potential."
      }
    },
    
    "elements": {
      "Fire": {
        "keywords": "action, enthusiasm, inspiration, initiative, courage",
        "high": "You are naturally energetic, enthusiastic, and action-oriented. Initiative comes easily and you inspire others through your passion. Your challenge is developing patience and considering consequences before acting.",
        "balanced": "You maintain healthy drive and enthusiasm balanced with other qualities. Action and inspiration serve your life without dominating it.",
        "low": "You may struggle with initiative, motivation, or self-confidence. Developing courage to take risks and express yourself boldly would enhance your life. Physical activity and passionate pursuits can awaken this dormant energy."
      },
      "Earth": {
        "keywords": "practicality, stability, sensuality, persistence, material focus",
        "high": "You are naturally grounded, practical, and focused on tangible results. Building lasting structures and working with physical reality comes easily. Your challenge is allowing spontaneity and not becoming overly materialistic or resistant to change.",
        "balanced": "You maintain healthy connection to physical reality balanced with other dimensions. Practicality serves your life without limiting it.",
        "low": "You may struggle with practical matters, financial stability, or follow-through. Developing patience and appreciation for gradual, tangible progress would enhance your life. Engaging your body and senses can awaken this dormant quality."
      },
      "Air": {
        "keywords": "thought, communication, ideas, social connection, objectivity",
        "high": "You are naturally intellectual, communicative, and socially skilled. Ideas and connections flow easily and you excel at objective analysis. Your challenge is staying grounded in your body and honoring emotional truth alongside rational thought.",
        "balanced": "You maintain healthy intellectual and social engagement balanced with other aspects of life. Mental activity serves you without disconnecting you from embodied experience.",
        "low": "You may struggle with clear thinking, communication, or social connection. Developing curiosity and willingness to share ideas would enhance your life. Reading, writing, and conversation can awaken this dormant quality."
      },
      "Water": {
        "keywords": "emotion, intuition, empathy, depth, sensitivity",
        "high": "You are naturally emotional, intuitive, and empathic. Depth and sensitivity come easily and you understand the invisible emotional currents others miss. Your challenge is maintaining boundaries and not drowning in feelings.",
        "balanced": "You maintain healthy emotional depth and intuition balanced with other qualities. Feelings inform your life without overwhelming it.",
        "low": "You may struggle with emotional expression, empathy, or intuitive knowing. Developing comfort with vulnerability and honoring feelings would enhance your life. Creative expression and water (literally) can awaken this dormant quality."
      }
    },
    
    "modalities": {
      "Cardinal": {
        "keywords": "initiative, leadership, starting, pioneering",
        "high": "You excel at initiating, leading, and starting new ventures. You're a natural pioneer but may struggle with follow-through. Your challenge is completing what you begin.",
        "balanced": "You initiate appropriately—starting what needs starting without compulsively beginning and abandoning projects.",
        "low": "You may struggle with initiative or leadership. Developing comfort with being first or taking charge would enhance your effectiveness."
      },
      "Fixed": {
        "keywords": "persistence, stability, determination, stubbornness",
        "high": "You excel at sustained effort, loyalty, and seeing things through. You're naturally persistent but may be inflexible. Your challenge is allowing change when circumstances demand it.",
        "balanced": "You persist appropriately—maintaining stability without rigidity, adapting when necessary.",
        "low": "You may struggle with commitment or endurance. Developing capacity to sustain effort and resist distraction would enhance your achievements."
      },
      "Mutable": {
        "keywords": "adaptability, flexibility, change, variety",
        "high": "You excel at adapting, learning, and handling change. You're naturally flexible but may lack focus or commitment. Your challenge is choosing a direction and sticking with it.",
        "balanced": "You adapt appropriately—flexible when needed, committed when appropriate.",
        "low": "You may struggle with change or new situations. Developing comfort with uncertainty and willingness to adapt would enhance your resilience."
      }
    },
    
    "dominant_planet": {
      "Sun": "Solar energy dominates your chart. Identity, self-expression, and creative vitality are central to your life purpose. You're here to shine, lead, and express your unique essence. Your challenge is balancing healthy self-focus with consideration for others.",
      "Moon": "Lunar energy dominates your chart. Emotions, nurturing, and security needs are central to your life purpose. You're here to feel deeply, care for others, and honor cyclical rhythms. Your challenge is maintaining boundaries while staying emotionally open.",
      "Mercury": "Mercurial energy dominates your chart. Communication, learning, and mental connection are central to your life purpose. You're here to think, speak, write, and connect ideas. Your challenge is balancing mental activity with embodied experience.",
      "Venus": "Venusian energy dominates your chart. Love, beauty, and values are central to your life purpose. You're here to appreciate beauty, form relationships, and create harmony. Your challenge is maintaining self-worth independent of others' approval.",
      "Mars": "Martial energy dominates your chart. Action, assertion, and willpower are central to your life purpose. You're here to take initiative, fight for what matters, and embody courage. Your challenge is balancing aggression with cooperation.",
      "Jupiter": "Jovian energy dominates your chart. Growth, meaning, and expansion are central to your life purpose. You're here to explore, learn, teach, and inspire optimism. Your challenge is avoiding excess and staying grounded.",
      "Saturn": "Saturnine energy dominates your chart. Structure, discipline, and mastery are central to your life purpose. You're here to build lasting achievements through patient effort. Your challenge is allowing joy and spontaneity alongside discipline.",
      "Uranus": "Uranian energy dominates your chart. Innovation, freedom, and authenticity are central to your life purpose. You're here to revolutionize, break patterns, and express originality. Your challenge is maintaining relationships while being radically yourself.",
      "Neptune": "Neptunian energy dominates your chart. Spirituality, creativity, and transcendence are central to your life purpose. You're here to dissolve boundaries, imagine alternatives, and embody compassion. Your challenge is staying grounded in reality.",
      "Pluto": "Plutonian energy dominates your chart. Transformation, power, and depth are central to your life purpose. You're here to confront shadow material, facilitate rebirth, and wield intensity responsibly. Your challenge is using power to empower rather than control."
    },
    
    "planetary_hours": {
      "Sun": "This hour is ruled by the Sun—favorable for leadership, self-expression, creativity, and matters of identity. Shine your light.",
      "Moon": "This hour is ruled by the Moon—favorable for emotional matters, nurturing, domestic activities, and intuitive work. Honor your feelings.",
      "Mercury": "This hour is ruled by Mercury—favorable for communication, learning, writing, commerce, and travel. Share your ideas.",
      "Venus": "This hour is ruled by Venus—favorable for love, beauty, art, pleasure, and socializing. Appreciate and create beauty.",
      "Mars": "This hour is ruled by Mars—favorable for physical activity, assertion, beginning new ventures, and competitive pursuits. Take action.",
      "Jupiter": "This hour is ruled by Jupiter—favorable for expansion, education, legal matters, philosophy, and optimistic endeavors. Think big.",
      "Saturn": "This hour is ruled by Saturn—favorable for serious work, long-term planning, discipline, and dealing with authority. Build foundations."
    },
    
    "transits": {
      "conjunction": {
        "Sun": "Current identity focus intensifies this natal point. What this planet represents becomes central to your self-expression right now.",
        "Moon": "Emotional needs and security concerns activate this natal point. You feel this area of life deeply in the present moment.",
        "Mercury": "Mental attention and communication focus on this natal point. You're thinking, talking, and learning about this area now.",
        "Venus": "Love, value, and attraction energize this natal point. Beauty and harmony manifest through this area currently.",
        "Mars": "Action and assertion target this natal point. You have energy to initiate and pursue goals in this area now.",
        "Jupiter": "Growth and opportunity expand this natal point. Optimism and possibility open in this area currently.",
        "Saturn": "Responsibility and testing focus on this natal point. You're building lasting structures or facing limitations here now.",
        "Uranus": "Change and awakening disrupt this natal point. Unexpected shifts and new freedom emerge in this area currently.",
        "Neptune": "Spirituality and dissolution affect this natal point. Boundaries blur and imagination activates here now.",
        "Pluto": "Transformation and intensity concentrate on this natal point. Death and rebirth processes are active in this area currently."
      },
      "opposition": {
        "Sun": "Your current identity challenges this natal point. External circumstances or others oppose what this represents.",
        "Moon": "Current emotional needs conflict with this natal point. What you need now tensions against this area of life.",
        "Mercury": "Current thinking opposes this natal point. Mental perspective conflicts with what this area represents.",
        "Venus": "Current relationships challenge this natal point. What you value now may conflict with this natal placement.",
        "Mars": "Current drive opposes this natal point. Your actions now create friction with this area of life.",
        "Jupiter": "Current growth challenges this natal point. Expansion in one area may restrict this placement.",
        "Saturn": "Current restrictions oppose this natal point. Limitations now conflict with this area of life.",
        "Uranus": "Current changes challenge this natal point. Disruption now creates tension with this placement.",
        "Neptune": "Current ideals conflict with this natal point. What you imagine now may oppose this area's reality.",
        "Pluto": "Current transformation opposes this natal point. Deep changes now create power struggles in this area."
      },
      "trine": {
        "Sun": "Current self-expression harmonizes with this natal point. Opportunities flow naturally through this area now.",
        "Moon": "Current emotions support this natal point. What you need aligns with what this area offers.",
        "Mercury": "Current thinking supports this natal point. Mental clarity and communication flow here easily now.",
        "Venus": "Current relationships harmonize with this natal point. Love and beauty enhance this area naturally.",
        "Mars": "Current actions support this natal point. Energy flows productively through this area now.",
        "Jupiter": "Current growth harmonizes with this natal point. Expansion happens naturally here with little resistance.",
        "Saturn": "Current discipline supports this natal point. Structure and maturity develop easily in this area.",
        "Uranus": "Current innovation harmonizes with this natal point. Change flows naturally without excessive disruption.",
        "Neptune": "Current spirituality supports this natal point. Imagination and compassion enhance this area naturally.",
        "Pluto": "Current transformation harmonizes with this natal point. Deep change flows powerfully but manageably."
      },
      "square": {
        "Sun": "Current identity creates friction with this natal point. Growth through challenge is active in this area now.",
        "Moon": "Current emotions create tension with this natal point. Uncomfortable feelings drive development here.",
        "Mercury": "Current thinking creates friction with this natal point. Mental challenges force clarity in this area.",
        "Venus": "Current values create tension with this natal point. Relationship challenges drive growth here now.",
        "Mars": "Current actions create friction with this natal point. Dynamic tension motivates change in this area.",
        "Jupiter": "Current expansion creates tension with this natal point. Growth comes through overcoming obstacles here.",
        "Saturn": "Current restrictions create friction with this natal point. Difficult lessons force maturity in this area.",
        "Uranus": "Current changes create tension with this natal point. Disruptive innovation forces adaptation here.",
        "Neptune": "Current ideals create friction with this natal point. Confusion or disillusionment drives spiritual growth.",
        "Pluto": "Current transformation creates intense friction with this natal point. Crisis drives profound change here."
      },
      "sextile": {
        "Sun": "Current identity offers opportunity for this natal point. Conscious effort activates potential here.",
        "Moon": "Current emotions offer opportunity for this natal point. Emotional engagement activates this area.",
        "Mercury": "Current thinking offers opportunity for this natal point. Mental effort activates potential here.",
        "Venus": "Current relationships offer opportunity for this natal point. Conscious appreciation activates this area.",
        "Mars": "Current action offers opportunity for this natal point. Initiative activates potential here now.",
        "Jupiter": "Current growth offers opportunity for this natal point. Optimistic effort expands this area.",
        "Saturn": "Current discipline offers opportunity for this natal point. Strategic work activates potential here.",
        "Uranus": "Current innovation offers opportunity for this natal point. Open-minded experimentation activates this area.",
        "Neptune": "Current spirituality offers opportunity for this natal point. Creative imagination activates potential here.",
        "Pluto": "Current transformation offers opportunity for this natal point. Deep work activates powerful change."
      }
    },
    
    "lunar_phases": {
      "new_moon": {
        "phase": "New Moon (0-45°)",
        "keywords": "instinct, impulse, spontaneity, subjective experience",
        "interpretation": "Born during the New Moon, you operate primarily through instinct and impulse. Your approach to life is spontaneous and subjective—you act first and analyze later. This phase indicates a personality that initiates without needing external validation. Your challenge is developing objectivity and learning from others' perspectives. You're here to start new cycles, trusting your gut even when you can't explain your knowing. The seed of consciousness is planted but not yet emerged into full awareness."
      },
      "crescent_moon": {
        "phase": "Crescent Moon (45-90°)",
        "keywords": "breaking away, struggle, determination, individualization",
        "interpretation": "Born during the Crescent Moon, you're a natural fighter who breaks from the past to establish new directions. Your life involves struggle against inherited patterns or limitations. This phase indicates determination to become something different from your origins. Your challenge is knowing when to stop fighting and accept support. You're here to pioneer new possibilities by courageously separating from tradition. The sprout breaks through soil—visible but vulnerable."
      },
      "first_quarter": {
        "phase": "First Quarter Moon (90-135°)",
        "keywords": "crisis in action, decision, building, manifestation",
        "interpretation": "Born during the First Quarter Moon, you face crises of action that force decisive choice. Your life involves building structures and manifesting intentions through concrete action. This phase indicates a personality that must act despite obstacles. Your challenge is overcoming doubt and commitment fears. You're here to translate vision into reality through persistent effort. The plant grows visibly—commitment to form is unavoidable."
      },
      "gibbous_moon": {
        "phase": "Gibbous Moon (135-180°)",
        "keywords": "refinement, analysis, perfection, dedication",
        "interpretation": "Born during the Gibbous Moon, you analyze, refine, and perfect what you've built. Your life involves dedication to improvement and preparation. This phase indicates a personality focused on doing things right. Your challenge is accepting good enough and not getting lost in endless refinement. You're here to develop skills and prepare for meaningful contribution. The bud forms—not yet flowering but pregnant with potential."
      },
      "full_moon": {
        "phase": "Full Moon (180-225°)",
        "keywords": "fulfillment, objectivity, relationship, illumination",
        "interpretation": "Born during the Full Moon, you seek fulfillment through relationship and objective understanding. Your life involves balancing opposing forces and seeing multiple perspectives. This phase indicates a personality that needs others to complete themselves. Your challenge is maintaining identity while deeply engaging with otherness. You're here to illuminate through clarity and achieve wholeness through integration of opposites. The flower blooms—maximum visibility and vulnerability."
      },
      "disseminating_moon": {
        "phase": "Disseminating Moon (225-270°)",
        "keywords": "sharing, teaching, demonstration, conviction",
        "interpretation": "Born during the Disseminating Moon, you share what you've learned and teach through demonstration. Your life involves communicating meaningful understanding to others. This phase indicates a personality with something important to share. Your challenge is accepting that not everyone wants what you offer. You're here to spread seeds of wisdom that may bloom in future generations. The flower forms seeds—giving away accumulated knowledge."
      },
      "last_quarter": {
        "phase": "Last Quarter Moon (270-315°)",
        "keywords": "crisis in consciousness, reorientation, transformation, wisdom",
        "interpretation": "Born during the Last Quarter Moon, you face crises of consciousness that force reorientation. Your life involves questioning established systems and transforming understanding. This phase indicates a personality that must break down old structures. Your challenge is not becoming bitter or cynical about necessary destruction. You're here to facilitate transition and prepare ground for new growth. The plant dies back—composting for future fertility."
      },
      "balsamic_moon": {
        "phase": "Balsamic Moon (315-360°)",
        "keywords": "release, transition, prophecy, endings",
        "interpretation": "Born during the Balsamic Moon, you release the past and prepare for future emergence. Your life involves endings, transitions, and prophetic vision. This phase indicates a personality that sees what's coming before it arrives. Your challenge is functioning in the present while perceiving future potentials. You're here to midwife transition and hold space for what's dying and what's being born. The seed forms in darkness—pregnant with next cycle's potential."
      }
    },
    
    "solar_return": {
      "interpretation": "Your Solar Return chart—calculated for the moment the Sun returns to its exact natal position—reveals the themes and opportunities of your upcoming year. This annual 'birthday chart' shows what the universe is emphasizing in your life from one birthday to the next. Pay special attention to which houses are activated and any planets closely aspecting your natal placements."
    },
    
    "progressions": {
      "interpretation": "Secondary Progressions reveal your psychological and spiritual age, which may differ from your physical age. Each day after birth equals one year of internal development. Your progressed chart shows how you've matured internally and what developmental themes are currently active in your psyche."
    },
    
    "chiron": {
      "description": "Chiron represents your deepest wound and your greatest healing gift. Where you've been most hurt is precisely where you develop the capacity to heal others. This asteroid shows both your vulnerability and your wisdom.",
      
      "chiron_in_sign": {
        "Aries": "Your wound involves identity, assertion, and the right to exist. You may have experienced invalidation of your selfhood or been told your needs don't matter. Your healing gift is teaching others to courageously be themselves and honor their anger and autonomy.",
        "Taurus": "Your wound involves worth, security, and the physical body. You may have experienced material instability or shame about your body/needs. Your healing gift is teaching others to value themselves and find security through self-worth rather than external validation.",
        "Gemini": "Your wound involves communication, intelligence, and being heard. You may have been silenced, mocked for your ideas, or told you're not smart enough. Your healing gift is teaching others to trust their voice and that all perspectives have value.",
        "Cancer": "Your wound involves nurturing, family, and emotional safety. You may have lacked adequate care or been made responsible for others' feelings too young. Your healing gift is teaching others healthy emotional boundaries and that it's okay to need care.",
        "Leo": "Your wound involves creativity, visibility, and special-ness. You may have been shamed for standing out or told your creative expression was worthless. Your healing gift is teaching others that everyone deserves to shine and be celebrated.",
        "Virgo": "Your wound involves perfection, usefulness, and health. You may have internalized that you're only valuable if perfect or experienced chronic health issues. Your healing gift is teaching others that wholeness includes imperfection and that being is as important as doing.",
        "Libra": "Your wound involves relationships, fairness, and belonging. You may have experienced rejection, betrayal, or been forced to choose sides. Your healing gift is teaching others that harmony doesn't require self-abandonment and that conflict can be creative.",
        "Scorpio": "Your wound involves power, trust, and intimacy. You may have experienced betrayal, abuse, or violation of boundaries. Your healing gift is teaching others that vulnerability is strength and that transformation is possible after trauma.",
        "Sagittarius": "Your wound involves meaning, truth, and belonging to something larger. You may have been shamed for your beliefs or experienced spiritual abuse. Your healing gift is teaching others that meaning is personal and that questioning is sacred.",
        "Capricorn": "Your wound involves authority, achievement, and maturity. You may have been forced to grow up too fast or had harsh, critical authority figures. Your healing gift is teaching others that worthiness isn't earned through achievement and that discipline can be compassionate.",
        "Aquarius": "Your wound involves belonging, authenticity, and difference. You may have been ostracized for being different or forced to conform. Your healing gift is teaching others that uniqueness is a gift and that true belonging comes from being authentic.",
        "Pisces": "Your wound involves boundaries, spirituality, and reality. You may have been overwhelmed by others' emotions or experienced spiritual bypassing. Your healing gift is teaching others that compassion includes self-compassion and that groundedness enables transcendence."
      }
    },
    
    "fixed_stars": {
      "description": "Fixed stars are distant suns whose influence has been observed for millennia. When a fixed star conjuncts (within 1°) a natal planet or angle, it adds a specific flavor or destiny quality to that point. These are ancient influences predating the zodiac.",
      
      "stars": {
        "Algol": {
          "longitude": 26.3,
          "sign": "Taurus",
          "nature": "challenging",
          "keywords": "the demon star, transformation through crisis, facing the shadow",
          "interpretation": "Algol, the most feared star in traditional astrology, conjuncts this point. You carry the archetype of Medusa—the one who transforms rage and trauma into power. This placement often indicates experiencing something 'evil' or traumatic that forces you to confront darkness. Your gift is the ability to face what others deny, transmute poison into medicine, and ultimately protect others from what harmed you. The Medusa energy turns those who gaze upon her to stone—you may freeze or be frozen by trauma, but ultimately develop the power to shield others."
        },
        "Pleiades": {
          "longitude": 29.8,
          "sign": "Taurus",
          "nature": "sensitive",
          "keywords": "the weeping sisters, ambition through sorrow, heightened sensitivity",
          "interpretation": "The Pleiades, known as the Seven Sisters, conjunct this point. You carry extraordinary sensitivity and ambition born from sorrow. Traditional astrology associated this with 'something in the eyes'—both literal vision issues and the ability to 'see' what others miss. You may experience losses that drive achievement or success that feels bittersweet. Your gift is transforming grief into creative accomplishment and understanding that ambition can be motivated by love for what's been lost."
        },
        "Aldebaran": {
          "longitude": 9.8,
          "sign": "Gemini",
          "nature": "honorable",
          "keywords": "the watcher of the east, integrity, honor, success through right action",
          "interpretation": "Aldebaran, one of the four Royal Stars, conjuncts this point. You're held to high standards of integrity—success comes through honorable action, but falls away if you compromise ethics. This star brings achievements but demands you remain true to your principles. Your gift is the ability to lead with honor and the understanding that true success is built on integrity rather than expedience."
        },
        "Rigel": {
          "longitude": 16.8,
          "sign": "Gemini",
          "nature": "successful",
          "keywords": "the foot of Orion, teaching, invention, lasting achievement",
          "interpretation": "Rigel, the bright foot star of Orion the Hunter, conjuncts this point. You have gifts for teaching, invention, and creating lasting knowledge. This star indicates the ability to take bold action and achieve recognition, often in educational, technical, or leadership fields. Your gift is bringing light through knowledge and the courage to pursue ambitious goals."
        },
        "Betelgeuse": {
          "longitude": 28.8,
          "sign": "Gemini",
          "nature": "successful",
          "keywords": "the shoulder of Orion, honor, riches, lasting success",
          "interpretation": "Betelgeuse, the great red giant star on Orion's shoulder, conjuncts this point. This star brings honors, success, and material prosperity, often in military, martial, or leadership contexts. You have the capacity for lasting achievement and the ability to inspire others through courage and action."
        },
        "Sirius": {
          "longitude": 14.1,
          "sign": "Cancer",
          "nature": "powerful",
          "keywords": "the dog star, the brightest star, ambition, fame, the divine",
          "interpretation": "Sirius, the brightest star in the sky, conjuncts this point. You carry powerful ambition and potential for fame or recognition. Ancient cultures considered Sirius sacred—you may have a sense of divine purpose or destiny. This star indicates leadership abilities and the capacity to 'shine' brightly. Your challenge is managing the intensity of this energy without burning out or becoming arrogant. Your gift is the ability to inspire others and achieve significant recognition."
        },
        "Regulus": {
          "longitude": 29.9,
          "sign": "Leo",
          "nature": "royal",
          "keywords": "the heart of the lion, kingship, success through generosity, the fall through revenge",
          "interpretation": "Regulus, the Royal Star and Heart of the Lion, conjuncts this point. You have natural leadership abilities and potential for significant success and recognition. Traditional astrology warns that Regulus's gifts fall away if you seek revenge—success comes through magnanimity and generosity, not vengeance. Your gift is the ability to lead with heart and inspire loyalty. Your challenge is maintaining nobility of character when wronged."
        },
        "Spica": {
          "longitude": 23.9,
          "sign": "Libra",
          "nature": "benefic",
          "keywords": "the wheat sheaf, gifts, protection, artistic success",
          "interpretation": "Spica, the star of the Virgin's wheat sheaf, conjuncts this point. This is considered one of the most fortunate stars, bringing gifts, protection, and success, particularly in artistic or Venusian fields. You have natural talents that attract opportunity and a protective quality that helps you avoid the worst consequences of mistakes. Your gift is the ability to create beauty and attract positive circumstances."
        },
        "Arcturus": {
          "longitude": 24.2,
          "sign": "Libra",
          "nature": "successful",
          "keywords": "the bear guardian, honor, riches, navigation",
          "interpretation": "Arcturus, one of the brightest stars and ancient navigation aid, conjuncts this point. You have the ability to guide others and find your way through complexity. Success comes through honorable action and the ability to see the bigger picture. Your gift is helping others navigate their paths while maintaining your own direction."
        },
        "Antares": {
          "longitude": 9.8,
          "sign": "Sagittarius",
          "nature": "intense",
          "keywords": "the heart of the scorpion, the rival of Mars, obsession, daring",
          "interpretation": "Antares, the Heart of the Scorpion and Rival of Mars, conjuncts this point. This star brings intensity, daring, and sometimes recklessness. You have tremendous drive and the willingness to risk everything for what you believe in. Traditional astrology associates this with 'troubles with eyesight'—both literal and metaphorical blindness to consequences when passionately pursuing goals. Your gift is the courage to go where others fear and the ability to transform through intensity."
        },
        "Fomalhaut": {
          "longitude": 3.9,
          "sign": "Pisces",
          "nature": "idealistic",
          "keywords": "the watcher of the south, idealism, the fall from grace, fame",
          "interpretation": "Fomalhaut, one of the four Royal Stars, conjuncts this point. This star brings idealism and potential for recognition, but traditional astrology warns of 'sudden fall from high position' if ethics are compromised. You're called to maintain high ideals and spiritual integrity. Success through this star is real but conditional on remaining true to principles. Your gift is the ability to inspire through idealism when you embody your values."
        }
      }
    },
    
    "void_of_course_moon": {
      "description": "The Moon is Void of Course (VOC) when it has made its last major aspect in its current sign before changing to the next sign. Traditional astrology considers this 'dead time' when actions taken tend not to manifest as expected. Plans made, purchases, contracts, and new beginnings during VOC Moon often come to nothing or require redoing.",
      "advice": "During VOC Moon, focus on routine tasks, meditation, creative work, and going with the flow rather than initiating important matters. Wait for the Moon to enter the next sign before signing contracts, starting projects, making major purchases, or scheduling important meetings."
    },

  "sabian_symbols": {
    "description": "Each of the 360 degrees of the zodiac has a unique Sabian Symbol - a poetic image channeled by clairvoyant Elsie Wheeler in 1925. These symbols provide specific, oracular insight into the exact degree placement of your planets.",

    "symbols": {
      "1": {"sign": "Aries", "degree": 1, "symbol": "A woman just risen from the sea; a seal is embracing her", "interpretation": "Emergence from the unconscious into conscious existence. The birth of new identity through embracing one's instinctual nature. You come into being through contact with primordial forces."},
      "2": {"sign": "Aries", "degree": 2, "symbol": "A comedian reveals human nature", "interpretation": "The ability to see and reflect the absurdities of existence with humor. You understand that laughter reveals truth more effectively than seriousness. Your gift is showing others themselves through playful observation."},
      "3": {"sign": "Aries", "degree": 3, "symbol": "A cameo profile of a man in the outline of his country", "interpretation": "Individual identity merged with collective destiny. You embody cultural or ancestral qualities that define you. Your personal story reflects a larger narrative beyond yourself."},
      "4": {"sign": "Aries", "degree": 4, "symbol": "Two lovers strolling through a secluded walk", "interpretation": "Private intimacy away from the world's demands. The need for sacred space where relationship can develop without external interference. You value creating protected environments for connection."},
      "5": {"sign": "Aries", "degree": 5, "symbol": "A triangle with wings", "interpretation": "Mental concepts taking flight. Abstract ideas becoming mobile and communicable. You have the ability to elevate thought beyond limitation and share visionary thinking."},
      "6": {"sign": "Aries", "degree": 6, "symbol": "A square brightly lit on one side", "interpretation": "Illumination revealing only partial truth. Understanding that all perspectives are limited by their vantage point. You learn to accept incomplete knowledge while acting with available light."},
      "7": {"sign": "Aries", "degree": 7, "symbol": "A man successfully expressing himself in two realms at once", "interpretation": "The ability to bridge different worlds simultaneously. You function effectively in multiple contexts, translating between them. Mastery comes through integration rather than choosing one path."},
      "8": {"sign": "Aries", "degree": 8, "symbol": "A large hat with streamers flying, facing east", "interpretation": "Readiness to greet new experience with openness and celebration. Your identity expands through welcoming what comes from the horizon. Ceremonial preparation for transformation."},
      "9": {"sign": "Aries", "degree": 9, "symbol": "A crystal gazer", "interpretation": "The ability to perceive potential futures and hidden patterns. You see through surface appearances into underlying structure. Prophetic vision that reads signs others miss."},
      "10": {"sign": "Aries", "degree": 10, "symbol": "A teacher gives new symbolic forms to traditional images", "interpretation": "Education through revelation rather than tradition. You bring forth what wasn't previously known. Your teaching comes from direct insight into emerging patterns."},
      "11": {"sign": "Aries", "degree": 11, "symbol": "The president of the country", "interpretation": "Authority earned through representing collective will. Leadership that embodies what the group needs expressed. You carry responsibility for articulating shared purpose."},
      "12": {"sign": "Aries", "degree": 12, "symbol": "A triangularly shaped flight of wild geese", "interpretation": "Instinctual organization for collective migration. Natural hierarchies that serve survival and progress. You understand how to move with others while maintaining formation."},
      "13": {"sign": "Aries", "degree": 13, "symbol": "An unsuccessful bomb explosion", "interpretation": "Potential destruction that doesn't manifest. Crisis averted through grace or timing. You learn that not all threats actualize—sometimes things simply don't go off."},
      "14": {"sign": "Aries", "degree": 14, "symbol": "A serpent coiling near a man and a woman", "interpretation": "Temptation or wisdom entering relationship. The introduction of knowledge that changes innocence. You face choices about whether to remain naive or embrace complexity."},
      "15": {"sign": "Aries", "degree": 15, "symbol": "An Indian weaving a blanket", "interpretation": "Patient craftsmanship creating warmth and protection. Traditional skills producing practical beauty. You understand that meaningful work requires sustained attention and cultural continuity."},
      "16": {"sign": "Aries", "degree": 16, "symbol": "Brownies dancing in the setting sun", "interpretation": "Hidden helpers celebrating the completion of daily work. Magic that appears at thresholds between day and night. You recognize support from unseen forces during transitions."},
      "17": {"sign": "Aries", "degree": 17, "symbol": "Two prim spinsters sitting together in silence", "interpretation": "Dignified restraint and unspoken understanding. Communication beyond words in relationships that honor boundaries. You value proper form and meaningful silence."},
      "18": {"sign": "Aries", "degree": 18, "symbol": "An empty hammock stretched between two trees", "interpretation": "Rest awaiting occupancy. Potential for relaxation that goes unused. You learn about readiness without forcing—the invitation to ease when you're prepared to accept it."},
      "19": {"sign": "Aries", "degree": 19, "symbol": "The magic carpet of Oriental imagery", "interpretation": "Transportation through imagination rather than physical means. Fantasy as legitimate vehicle for change. You travel through visualization and creative thinking."},
      "20": {"sign": "Aries", "degree": 20, "symbol": "A young girl feeding birds in winter", "interpretation": "Compassion for vulnerable life during harsh conditions. Nurturing what cannot fend for itself. You maintain caring through difficulty, sustaining what would otherwise perish."},
      "21": {"sign": "Aries", "degree": 21, "symbol": "A pugilist enters the ring", "interpretation": "Willingness to engage in direct combat for what matters. Courage to step into the arena and fight. You don't shy from confrontation when principles are at stake."},
      "22": {"sign": "Aries", "degree": 22, "symbol": "The gate to the garden of all fulfilled desires", "interpretation": "Standing at the threshold of manifestation. Access to abundance requires only entry. You learn that fulfillment awaits on the other side of taking action."},
      "23": {"sign": "Aries", "degree": 23, "symbol": "A woman in pastel colors carrying a heavy and valuable but veiled load", "interpretation": "Grace under the weight of responsibility. Valuable obligations that strain but don't break you. You carry what's precious despite difficulty, though others may not see the burden."},
      "24": {"sign": "Aries", "degree": 24, "symbol": "Blown inward by the wind, the curtains of an open window take the shape of a cornucopia", "interpretation": "Abundance entering through openness to external forces. Allowing life to fill you rather than grasping. You receive plenty when you create receptive space."},
      "25": {"sign": "Aries", "degree": 25, "symbol": "A double promise reveals its inner and outer meanings", "interpretation": "Commitments operating on multiple levels simultaneously. Understanding that agreements have both literal and symbolic dimensions. You honor both surface and depth meanings."},
      "26": {"sign": "Aries", "degree": 26, "symbol": "A man possessed of more gifts than he can hold", "interpretation": "Overwhelming abundance requiring selectivity. More blessings than can be utilized. You learn that having everything means choosing what to actually use."},
      "27": {"sign": "Aries", "degree": 27, "symbol": "Lost opportunity regained in the imagination", "interpretation": "Redeeming what was missed through creative revisioning. The second chance that exists in mental realms. You transform regret into renewed possibility through reimagining."},
      "28": {"sign": "Aries", "degree": 28, "symbol": "A large disappointed audience", "interpretation": "Collective expectations not met. The experience of failing to deliver what was anticipated. You learn about disappointment as teacher and the courage to face unfulfilled hopes."},
      "29": {"sign": "Aries", "degree": 29, "symbol": "The music of the spheres", "interpretation": "Cosmic harmony underlying existence. The mathematical perfection of celestial movement. You attune to universal order and the music inherent in structure."},
      "30": {"sign": "Aries", "degree": 30, "symbol": "A duck pond and its brood", "interpretation": "Nurturing provided through natural environment. Safe waters for young life to develop. You create or find protected spaces for growth and family development."},
      "31": {"sign": "Taurus", "degree": 1, "symbol": "A clear mountain stream", "interpretation": "Pure flow from elevated sources. Clarity and freshness that originates in high places and brings refreshment. You channel pristine energy from peak experiences."},
      "32": {"sign": "Taurus", "degree": 2, "symbol": "An electrical storm", "interpretation": "Sudden discharge of accumulated tension. Natural forces demonstrating power dramatically. You experience breakthrough through intensity that clears the atmosphere."},
      "33": {"sign": "Taurus", "degree": 3, "symbol": "Steps up to a lawn blooming with clover", "interpretation": "Effort leading to simple abundance. Natural prosperity awaiting those who make the climb. You find that elevation brings you to fields of good fortune."},
      "34": {"sign": "Taurus", "degree": 4, "symbol": "The rainbow's pot of gold", "interpretation": "Treasure at the meeting of earth and heaven. Reward found where different realms intersect. You discover value through bridging material and spiritual."},
      "35": {"sign": "Taurus", "degree": 5, "symbol": "A widow at an open grave", "interpretation": "Facing loss with dignity. Standing at the threshold between life and death with what remains. You learn strength through grief and the reality of endings."},
      "36": {"sign": "Taurus", "degree": 6, "symbol": "A bridge being built across a gorge", "interpretation": "Creating connection across dangerous divisions. Engineering relationship between separated places. You build passages over what seems unbridgeable."},
      "37": {"sign": "Taurus", "degree": 7, "symbol": "A woman of Samaria at the ancestral well", "interpretation": "Drawing from traditional sources despite being outsider. Access to spiritual nourishment across social boundaries. You find sustenance in heritage that isn't originally yours."},
      "38": {"sign": "Taurus", "degree": 8, "symbol": "A sleigh on land uncovered by snow", "interpretation": "Inappropriate tools for current conditions. Resources designed for different circumstances. You adapt when what worked before no longer fits the situation."},
      "39": {"sign": "Taurus", "degree": 9, "symbol": "A Christmas tree decorated", "interpretation": "Celebration adorning natural life. Culture embellishing what grows freely. You bring festivity and meaning through ornamentation of the simple."},
      "40": {"sign": "Taurus", "degree": 10, "symbol": "A Red Cross nurse", "interpretation": "Service during crisis with training and compassion. Organized aid during suffering. You provide skilled help when others face their darkest hours."},
      "41": {"sign": "Taurus", "degree": 11, "symbol": "A woman watering flowers in a garden", "interpretation": "Nurturing beauty through patient attention. Cultivation of what blooms. You maintain loveliness through consistent care and devotion to growth."},
      "42": {"sign": "Taurus", "degree": 12, "symbol": "A young couple window-shopping", "interpretation": "Dreaming together of future acquisition. Shared fantasy about material life without yet possessing. You build relationship through imagining what you'll create together."},
      "43": {"sign": "Taurus", "degree": 13, "symbol": "A porter carrying heavy baggage", "interpretation": "Bearing others' burdens for compensation. Service through strength and endurance. You carry weight that isn't yours as part of your work."},
      "44": {"sign": "Taurus", "degree": 14, "symbol": "Shellfish groping and children playing", "interpretation": "Instinctual exploration and innocent joy in tidal zones. Different modes of engagement with liminal spaces. You balance primitive seeking with playful discovery."},
      "45": {"sign": "Taurus", "degree": 15, "symbol": "A man muffled up, with a rakish silk hat", "interpretation": "Contradiction between protection and display. Covering vulnerability while asserting personality. You navigate between hiding and showing yourself."},
      "46": {"sign": "Taurus", "degree": 16, "symbol": "An old teacher fails to interest his pupils in traditional knowledge", "interpretation": "Wisdom losing relevance to new generations. The challenge of transmitting what no longer resonates. You face the obsolescence of cherished understandings."},
      "47": {"sign": "Taurus", "degree": 17, "symbol": "A battle between the swords and the torches", "interpretation": "Conflict between force and enlightenment. Physical power versus illuminating truth. You witness or participate in struggles about how to create change."},
      "48": {"sign": "Taurus", "degree": 18, "symbol": "A woman airing an old bag through a sunny window", "interpretation": "Exposure of accumulated dust to purifying light. Cleansing what's been stored in darkness. You refresh what's been kept too long without air."},
      "49": {"sign": "Taurus", "degree": 19, "symbol": "A newly formed continent", "interpretation": "Fresh ground emerging from primordial waters. New territory for exploration and settlement. You encounter virgin possibilities requiring pioneering."},
      "50": {"sign": "Taurus", "degree": 20, "symbol": "Wisps of winglike clouds streaming across the sky", "interpretation": "Ethereal movement suggesting transcendence. Beauty in transition and the temporary. You appreciate fleeting grace and changing forms."},
      "51": {"sign": "Taurus", "degree": 21, "symbol": "A finger pointing to a line in an open book", "interpretation": "Specific guidance within accumulated wisdom. Being directed to exact knowledge needed. You find precise answers when you consult traditional sources."},
      "52": {"sign": "Taurus", "degree": 22, "symbol": "A white dove flying over troubled waters", "interpretation": "Peace descending on chaos. Hope appearing during crisis. You recognize or embody the messenger of resolution during turbulence."},
      "53": {"sign": "Taurus", "degree": 23, "symbol": "A jewelry shop filled with magnificent gems", "interpretation": "Concentrated beauty and value on display. Abundance of precious objects offered for acquisition. You encounter overwhelming wealth of treasures to choose from."},
      "54": {"sign": "Taurus", "degree": 24, "symbol": "A mounted Indian with scalp locks", "interpretation": "Warrior carrying trophies of conquest. Pride in victories over enemies. You display what you've won through combat and skill."},
      "55": {"sign": "Taurus", "degree": 25, "symbol": "A large well-kept public park", "interpretation": "Shared natural beauty maintained for collective enjoyment. Common resources that serve all. You appreciate or create spaces where everyone can access refreshment."},
      "56": {"sign": "Taurus", "degree": 26, "symbol": "A Spaniard serenading his sweetheart", "interpretation": "Passionate declaration through artistic expression. Cultural modes of courtship and devotion. You woo through beauty and traditional forms of romance."},
      "57": {"sign": "Taurus", "degree": 27, "symbol": "An old Indian woman selling beads", "interpretation": "Traditional crafts and elder wisdom offered to those who value them. Small commerce preserving cultural heritage. You trade in what connects to ancestry."},
      "58": {"sign": "Taurus", "degree": 28, "symbol": "A woman pursued by mature romance", "interpretation": "Love arriving later in life with depth and wisdom. Courtship informed by experience rather than youthful passion. You encounter or offer sophisticated affection."},
      "59": {"sign": "Taurus", "degree": 29, "symbol": "Two cobblers working at a table", "interpretation": "Collaborative craftsmanship in practical trades. Partnership in skilled labor. You work alongside others to repair what's worn."},
      "60": {"sign": "Taurus", "degree": 30, "symbol": "A peacock parading on an ancient lawn", "interpretation": "Natural vanity displaying beauty in established settings. Pride appropriate to magnificent qualities. You show yourself without shame in environments that appreciate you."},
      "61": {"sign": "Gemini", "degree": 1, "symbol": "A glass-bottomed boat in still water", "interpretation": "Transparent observation of hidden depths. The ability to see beneath the surface while remaining above. You perceive what's submerged without diving into it yourself."},
      "62": {"sign": "Gemini", "degree": 2, "symbol": "Santa Claus filling stockings furtively", "interpretation": "Secret generosity and hidden gift-giving. Joy in providing without claiming credit. You delight in anonymous contribution and the magic of mysterious beneficence."},
      "63": {"sign": "Gemini", "degree": 3, "symbol": "The garden of the Tuileries in Paris", "interpretation": "Cultivated beauty in the heart of civilization. Public spaces where nature is artfully arranged. You appreciate or create environments where culture and nature harmonize."},
      "64": {"sign": "Gemini", "degree": 4, "symbol": "Holly and mistletoe bring Christmas spirit to a home", "interpretation": "Seasonal symbols inviting sacred energy into domestic space. Tradition that transforms ordinary into holy. You understand how ritual objects carry meaning that changes atmosphere."},
      "65": {"sign": "Gemini", "degree": 5, "symbol": "A revolutionary magazine asking for action", "interpretation": "Communication demanding immediate change. Words that incite rather than merely inform. You use or encounter language that compels transformation."},
      "66": {"sign": "Gemini", "degree": 6, "symbol": "Drilling for oil", "interpretation": "Penetrating beneath surface to access buried wealth. Effort to reach hidden resources. You dig deep for what's valuable but concealed."},
      "67": {"sign": "Gemini", "degree": 7, "symbol": "An old-fashioned well", "interpretation": "Traditional source of sustenance still functioning. Ancient methods that continue to provide. You draw from time-tested resources that remain relevant."},
      "68": {"sign": "Gemini", "degree": 8, "symbol": "Industrious strikers", "interpretation": "Organized withdrawal of labor for collective benefit. Strategic refusal as powerful action. You understand that not participating can be as effective as participating."},
      "69": {"sign": "Gemini", "degree": 9, "symbol": "A quiver filled with arrows", "interpretation": "Readiness with multiple options for directed force. Preparation providing choices about how to strike. You maintain resources allowing selective engagement."},
      "70": {"sign": "Gemini", "degree": 10, "symbol": "An airplane performing a nose dive", "interpretation": "Controlled descent requiring skill and nerve. Intentional movement through danger. You navigate risky maneuvers with technical precision."},
      "71": {"sign": "Gemini", "degree": 11, "symbol": "A new path of realism in experience", "interpretation": "Abandoning illusions for direct encounter with facts. The courage to see what actually is. You commit to unvarnished truth over comforting fantasy."},
      "72": {"sign": "Gemini", "degree": 12, "symbol": "A Negro girl fights for her independence", "interpretation": "Struggle for autonomy against oppressive structures. Personal freedom requiring fierce assertion. You fight for the right to self-determination."},
      "73": {"sign": "Gemini", "degree": 13, "symbol": "A famous pianist giving a concert", "interpretation": "Mastery displayed publicly. Virtuosity shared with audience. You perform expertise or witness excellence that inspires."},
      "74": {"sign": "Gemini", "degree": 14, "symbol": "Bridging physical differences", "interpretation": "Creating connection across apparent incompatibilities. Communication that transcends obvious barriers. You find commonality despite surface divisions."},
      "75": {"sign": "Gemini", "degree": 15, "symbol": "Two Dutch children talking", "interpretation": "Innocent exchange in cultural context. Simple communication carrying ethnic flavor. You engage in conversations shaped by shared background."},
      "76": {"sign": "Gemini", "degree": 16, "symbol": "A woman activist in an emotional speech", "interpretation": "Passionate advocacy through eloquent expression. Feelings channeled into persuasive communication. You speak truth with emotional force."},
      "77": {"sign": "Gemini", "degree": 17, "symbol": "The head of a robust youth changes into that of a mature thinker", "interpretation": "Transformation from physical vitality to mental depth. Evolution from action to contemplation. You witness or experience the shift from doing to understanding."},
      "78": {"sign": "Gemini", "degree": 18, "symbol": "Two Chinese men talking Chinese in a Western crowd", "interpretation": "Private communication within alien environment. Maintaining cultural identity while surrounded by difference. You preserve your language when immersed in otherness."},
      "79": {"sign": "Gemini", "degree": 19, "symbol": "A large archaic volume", "interpretation": "Ancient wisdom preserved in physical form. Knowledge from distant past still accessible. You encounter teachings that survived through time."},
      "80": {"sign": "Gemini", "degree": 20, "symbol": "A modern cafeteria", "interpretation": "Efficient provision of varied nourishment. Self-service from abundant options. You navigate systems offering choice without personal service."},
      "81": {"sign": "Gemini", "degree": 21, "symbol": "A tumultuous labor demonstration", "interpretation": "Collective anger demanding justice. Workers united in protest. You witness or join mass movements for economic rights."},
      "82": {"sign": "Gemini", "degree": 22, "symbol": "A barn dance", "interpretation": "Rural celebration bringing community together. Simple pleasure in collective movement. You find joy in unpretentious gatherings."},
      "83": {"sign": "Gemini", "degree": 23, "symbol": "Three fledglings in a nest high in a tree", "interpretation": "Vulnerable new life in precarious but elevated position. Youth protected while developing. You nurture what's not yet ready to fly."},
      "84": {"sign": "Gemini", "degree": 24, "symbol": "Children skating on ice", "interpretation": "Joy found in mastering temporary conditions. Play on frozen surfaces. You delight in activities made possible by specific circumstances."},
      "85": {"sign": "Gemini", "degree": 25, "symbol": "A man trimming palms", "interpretation": "Maintenance of tropical growth. Cultivation requiring regular attention. You manage what flourishes abundantly but needs shaping."},
      "86": {"sign": "Gemini", "degree": 26, "symbol": "Winter frost in the woods", "interpretation": "Cold beauty transforming familiar landscape. Temporary enchantment through freezing. You witness ordinary things made extraordinary by conditions."},
      "87": {"sign": "Gemini", "degree": 27, "symbol": "A gypsy coming out of the forest", "interpretation": "Wanderer emerging from wild into civilization. The outsider appearing from margins. You bridge between untamed and domestic spaces."},
      "88": {"sign": "Gemini", "degree": 28, "symbol": "A man declared bankrupt", "interpretation": "Public acknowledgment of material failure. Loss requiring complete restart. You face or witness the collapse of financial structures."},
      "89": {"sign": "Gemini", "degree": 29, "symbol": "The first mockingbird in spring", "interpretation": "Harbinger of seasonal change through song. The announcer of transformation. You recognize or embody signals that new times arrive."},
      "90": {"sign": "Gemini", "degree": 30, "symbol": "A parade of bathing beauties", "interpretation": "Display of physical attractions for judgment. Beauty offered for comparative evaluation. You participate in or observe competitions of appearance."},
      "91": {"sign": "Cancer", "degree": 1, "symbol": "A furled and unfurled flag displayed from a vessel", "interpretation": "Communication of identity and intention through symbols. Signals that can be shown or hidden. You control when to declare allegiance."},
      "92": {"sign": "Cancer", "degree": 2, "symbol": "A man on a magic carpet observes vast horizons", "interpretation": "Elevated perspective through imaginative vehicles. Seeing far through fantastical means. You gain overview by transcending ordinary limitations."},
      "93": {"sign": "Cancer", "degree": 3, "symbol": "A man all bundled up in fur leads a shaggy deer", "interpretation": "Guiding instinctual nature while protected from elements. Leading what's wild through harsh conditions. You direct primitive forces while insulated."},
      "94": {"sign": "Cancer", "degree": 4, "symbol": "A cat arguing with a mouse", "interpretation": "Predator and prey in unlikely negotiation. Natural enemies attempting communication. You engage in dialogues across power imbalances."},
      "95": {"sign": "Cancer", "degree": 5, "symbol": "An automobile wrecked by a train", "interpretation": "Modern convenience destroyed by more powerful force. Personal mobility crushed by collective system. You experience or witness individual plans demolished by larger mechanisms."},
      "96": {"sign": "Cancer", "degree": 6, "symbol": "Game birds feathering their nests", "interpretation": "Creatures preparing comfortable homes. Instinctual decoration of domestic space. You make your environment cozy through natural impulse."},
      "97": {"sign": "Cancer", "degree": 7, "symbol": "Two fairies dancing on a moonlit night", "interpretation": "Magical beings celebrating in liminal time. Enchantment during transitional hours. You access subtle realms during threshold moments."},
      "98": {"sign": "Cancer", "degree": 8, "symbol": "Rabbits dressed in clothes and on parade", "interpretation": "Animals given human characteristics and display. Nature performing culture. You witness or embody the comical intersection of instinct and civilization."},
      "99": {"sign": "Cancer", "degree": 9, "symbol": "A small naked girl bends over a pond trying to catch a fish", "interpretation": "Innocent attempt to grasp what's slippery. Childlike directness pursuing what evades. You approach elusive goals with unselfconscious simplicity."},
      "100": {"sign": "Cancer", "degree": 10, "symbol": "A large diamond not completely cut", "interpretation": "Valuable material partially refined. Brilliance still being revealed through work. You recognize worth before full polish."},
      "101": {"sign": "Cancer", "degree": 11, "symbol": "A clown making grimaces", "interpretation": "Exaggerated expression revealing hidden emotions. Humor through distortion. You show truth by amplifying features beyond normal."},
      "102": {"sign": "Cancer", "degree": 12, "symbol": "A Chinese woman nursing a baby whose aura reveals him to be the reincarnation of a great teacher", "interpretation": "Ordinary care for extraordinary being. Nurturing what contains hidden greatness. You attend to what appears simple but holds profound potential."},
      "103": {"sign": "Cancer", "degree": 13, "symbol": "A hand with a prominent thumb is held out for study", "interpretation": "Willpower and individuality offered for examination. Personal characteristics displayed for analysis. You present or analyze markers of identity and determination."},
      "104": {"sign": "Cancer", "degree": 14, "symbol": "A very old man facing a vast dark space to the northeast", "interpretation": "Elder confronting unknown territory. Age meeting mystery without maps. You face uncertainty with accumulated experience but no guarantees."},
      "105": {"sign": "Cancer", "degree": 15, "symbol": "A group of people who have overeaten and enjoyed it", "interpretation": "Excess accepted without guilt. Indulgence celebrated rather than regretted. You allow pleasure beyond necessity."},
      "106": {"sign": "Cancer", "degree": 16, "symbol": "A man before a square with a manuscript scroll before him", "interpretation": "Public presentation of written wisdom. Formal announcement of documented knowledge. You declare or witness official proclamations."},
      "107": {"sign": "Cancer", "degree": 17, "symbol": "The seed grows into knowledge and life", "interpretation": "Potential developing into actualization. Latent becoming manifest through growth. You nurture what's planted until it reveals itself."},
      "108": {"sign": "Cancer", "degree": 18, "symbol": "A hen scratching for her chicks", "interpretation": "Maternal effort providing for dependents. Working to feed those who rely on you. You labor for the benefit of what you protect."},
      "109": {"sign": "Cancer", "degree": 19, "symbol": "A priest performing a marriage ceremony", "interpretation": "Sacred officiation joining two into one. Authority blessing union. You facilitate or witness bonds sanctified."},
      "110": {"sign": "Cancer", "degree": 20, "symbol": "Venetian gondoliers in a serenade", "interpretation": "Romantic communication through traditional cultural form. Song carrying lovers through waters. You express or receive affection through artistic heritage."},
      "111": {"sign": "Cancer", "degree": 21, "symbol": "A prima donna singing", "interpretation": "Star performer displaying virtuosity. Female excellence commanding attention. You witness or embody mastery that dominates space."},
      "112": {"sign": "Cancer", "degree": 22, "symbol": "A woman awaiting a sailboat", "interpretation": "Patient anticipation of arrival by wind. Waiting for what travels at nature's pace. You prepare for what comes when conditions allow."},
      "113": {"sign": "Cancer", "degree": 23, "symbol": "The meeting of a literary society", "interpretation": "Gathering centered on written word. Collective appreciation of literature. You join or observe communities formed around texts."},
      "114": {"sign": "Cancer", "degree": 24, "symbol": "A woman and two men on a bit of sunlit land facing south", "interpretation": "Relationship triangle in illuminated space. Three people in geometric tension with direction. You navigate the complexity of multiple connections oriented toward warmth."},
      "115": {"sign": "Cancer", "degree": 25, "symbol": "A dark shadow or mantle thrown suddenly over the right shoulder", "interpretation": "Burden or protection arriving unexpectedly. Covering that changes status. You receive responsibility or shelter without warning."},
      "116": {"sign": "Cancer", "degree": 26, "symbol": "Guests are reading in the library of a luxurious home", "interpretation": "Cultivation and comfort in private intellectual space. Shared contemplation in opulent setting. You enjoy or provide refined environments for thought."},
      "117": {"sign": "Cancer", "degree": 27, "symbol": "A violent storm in a canyon filled with expensive homes", "interpretation": "Natural fury threatening accumulated wealth. Crisis indifferent to material value. You witness or experience forces that don't respect possessions."},
      "118": {"sign": "Cancer", "degree": 28, "symbol": "A modern pocahontas", "interpretation": "Bridge figure between cultures in contemporary context. Translator across civilizations now. You mediate between different worlds in current times."},
      "119": {"sign": "Cancer", "degree": 29, "symbol": "A muse weighing newborn twins in golden scales", "interpretation": "Measuring equivalent but distinct new creations. Evaluating dual births for balance. You assess paired possibilities for their relative worth."},
      "120": {"sign": "Cancer", "degree": 30, "symbol": "A daughter of the American Revolution", "interpretation": "Inheritor of revolutionary legacy. Identity based on ancestral transformation. You carry the mantle of historical change through lineage."},
      "121": {"sign": "Leo", "degree": 1, "symbol": "Blood rushes to a man's head as his vital energies are mobilized under the spur of ambition", "interpretation": "Passionate drive activating full force. Desire flooding consciousness with power. You experience or embody the moment when ambition overtakes all else."},
      "122": {"sign": "Leo", "degree": 2, "symbol": "An epidemic of mumps", "interpretation": "Contagious discomfort spreading through community. Shared minor suffering connecting people. You participate in collective minor ailments that bond through common experience."},
      "123": {"sign": "Leo", "degree": 3, "symbol": "A middle-aged woman, her long hair flowing over her shoulders and in a braless youthful garment", "interpretation": "Defiance of age-appropriate conventions. Mature person claiming youthful freedom. You reject or witness rejection of prescribed behavior for one's life stage."},
      "124": {"sign": "Leo", "degree": 4, "symbol": "A man formally dressed and a deer with its horns folded", "interpretation": "Civilization and nature both in submissive postures. Cultural refinement meeting tamed wildness. You encounter moments when both human and animal are restrained."},
      "125": {"sign": "Leo", "degree": 5, "symbol": "Rock formations tower over a deep canyon", "interpretation": "Ancient structures dominating vast depths. Permanence presiding over emptiness. You witness or embody the enduring overlooking the abyss."},
      "126": {"sign": "Leo", "degree": 6, "symbol": "A conservative, old-fashioned lady is confronted by a hippie girl", "interpretation": "Traditional values meeting countercultural rebellion. Generational clash of lifestyles. You navigate or observe the tension between convention and revolution."},
      "127": {"sign": "Leo", "degree": 7, "symbol": "The constellations in the sky", "interpretation": "Celestial patterns providing guidance and meaning. Stars arranged into recognizable forms. You read significance in what's written above."},
      "128": {"sign": "Leo", "degree": 8, "symbol": "A Bolshevik propagandist", "interpretation": "Revolutionary message delivered with conviction. Ideological communication seeking converts. You spread or encounter passionate political vision."},
      "129": {"sign": "Leo", "degree": 9, "symbol": "Glass blowers", "interpretation": "Artists shaping molten material into form. Breath transforming substance. You give shape to what's formless through skill and timing."},
      "130": {"sign": "Leo", "degree": 10, "symbol": "Early morning dew", "interpretation": "Fresh moisture greeting new day. Temporary blessing on grass. You witness or embody renewal that comes with dawn."},
      "131": {"sign": "Leo", "degree": 11, "symbol": "Children on a swing in a huge oak tree", "interpretation": "Youth playing in ancient shelter. Joy suspended from enduring support. You find or provide safety where generations can play."},
      "132": {"sign": "Leo", "degree": 12, "symbol": "An evening lawn party", "interpretation": "Social gathering in cultivated outdoor space. Civilized celebration in nature. You participate in refined communal enjoyment."},
      "133": {"sign": "Leo", "degree": 13, "symbol": "An old sea captain rocking on the porch of his cottage", "interpretation": "Retired adventurer reflecting on journeys completed. Seasoned wisdom at rest. You embody or encounter those who've returned from quests to contemplation."},
      "134": {"sign": "Leo", "degree": 14, "symbol": "A human soul seeking opportunities for expression", "interpretation": "Essential self looking for manifestation. Spirit wanting vehicle. You feel or witness the drive for incarnation and visibility."},
      "135": {"sign": "Leo", "degree": 15, "symbol": "A pageant", "interpretation": "Elaborate display of culture and history. Ceremonial procession showing collective identity. You participate in or observe formal presentations of meaning."},
      "136": {"sign": "Leo", "degree": 16, "symbol": "Sunshine just after a storm", "interpretation": "Light returning after turbulence. Relief and clarity following difficulty. You experience or bring the breakthrough after crisis."},
      "137": {"sign": "Leo", "degree": 17, "symbol": "A volunteer church choir", "interpretation": "Unpaid voices joining in sacred song. Community offering harmonized praise. You contribute freely to collective spiritual expression."},
      "138": {"sign": "Leo", "degree": 18, "symbol": "A chemist conducts an experiment for his students", "interpretation": "Teacher demonstrating transformation through knowledge. Education through controlled change. You show others how elements interact when properly combined."},
      "139": {"sign": "Leo", "degree": 19, "symbol": "A houseboat party", "interpretation": "Social gathering on floating home. Celebration that can move with water. You enjoy mobility combined with domestic comfort."},
      "140": {"sign": "Leo", "degree": 20, "symbol": "The Zuni sun worshipers", "interpretation": "Indigenous ceremony honoring solar power. Cultural reverence for life-giving force. You participate in or witness traditional acknowledgment of cosmic gifts."},
      "141": {"sign": "Leo", "degree": 21, "symbol": "Chickens intoxicated", "interpretation": "Domestic creatures in altered states. Barnyard animals behaving strangely. You witness or experience the unexpected in ordinary contexts."},
      "142": {"sign": "Leo", "degree": 22, "symbol": "A carrier pigeon", "interpretation": "Messenger traveling between locations. Communication through trained instinct. You carry or receive information across distances."},
      "143": {"sign": "Leo", "degree": 23, "symbol": "A bareback rider", "interpretation": "Performer mastering animal without barrier. Direct contact requiring skill and courage. You engage challenges without protective intermediaries."},
      "144": {"sign": "Leo", "degree": 24, "symbol": "Totally concentrated upon inner spiritual attainment, a man is sitting in a state of complete neglect of bodily appearance and cleanliness", "interpretation": "Spiritual focus at expense of physical maintenance. Transcendence prioritized over hygiene. You pursue or witness devotion that abandons worldly concerns."},
      "145": {"sign": "Leo", "degree": 25, "symbol": "A large camel crossing a vast and forbidding desert", "interpretation": "Endurance traversing hostile environment. Specialized adaptation to harsh conditions. You persist through what would defeat others."},
      "146": {"sign": "Leo", "degree": 26, "symbol": "After the heavy storm, a rainbow", "interpretation": "Beauty and promise following destruction. Hope appearing after chaos. You witness or embody renewal after devastation."},
      "147": {"sign": "Leo", "degree": 27, "symbol": "The luminescence of dawn in the eastern sky", "interpretation": "Light announcing day before sun appears. Anticipation of full illumination. You herald or recognize what's coming before others see it."},
      "148": {"sign": "Leo", "degree": 28, "symbol": "Many little birds on the limb of a large tree", "interpretation": "Small creatures gathering on strong support. Community assembling on enduring foundation. You join or host collective life sustained by something greater."},
      "149": {"sign": "Leo", "degree": 29, "symbol": "A mermaid emerges from the ocean ready for rebirth in human form", "interpretation": "Transformation from one state of being to another. Evolution from water to land. You undergo or witness fundamental change of nature."},
      "150": {"sign": "Leo", "degree": 30, "symbol": "An unsealed letter", "interpretation": "Communication accessible without barriers. Message available to any reader. You create or encounter information without privacy protection."},
      "151": {"sign": "Virgo", "degree": 1, "symbol": "A man's head", "interpretation": "Intellect and identity distilled to essential form. Thinking isolated from body. You focus on or embody pure mental functioning."},
      "152": {"sign": "Virgo", "degree": 2, "symbol": "A large white cross dominates the landscape", "interpretation": "Spiritual symbol commanding environment. Religious presence impossible to ignore. You encounter or embody faith that shapes all around it."},
      "153": {"sign": "Virgo", "degree": 3, "symbol": "Two guardian angels", "interpretation": "Dual protection watching over. Paired invisible support. You are shielded by forces you cannot see but can trust."},
      "154": {"sign": "Virgo", "degree": 4, "symbol": "A colored child playing with white children", "interpretation": "Innocent integration transcending social division. Play that ignores racial boundaries. You participate in or create spaces where difference doesn't prevent connection."},
      "155": {"sign": "Virgo", "degree": 5, "symbol": "A man becoming aware of nature spirits and normally unseen spiritual agencies", "interpretation": "Perception opening to subtle realms. Recognition of invisible presences. You develop sensitivity to what most cannot detect."},
      "156": {"sign": "Virgo", "degree": 6, "symbol": "A merry-go-round", "interpretation": "Circular motion providing pleasure. Entertainment through repetition. You find joy in cycles that return you to where you began."},
      "157": {"sign": "Virgo", "degree": 7, "symbol": "A harem", "interpretation": "Women kept for one man's pleasure. Confined beauty serving masculine desire. You encounter or navigate structures of possession and exclusion."},
      "158": {"sign": "Virgo", "degree": 8, "symbol": "A five-year-old child takes a first dancing lesson", "interpretation": "Initial instruction in rhythmic movement. Beginning to learn bodily expression. You start the journey of coordinated grace."},
      "159": {"sign": "Virgo", "degree": 9, "symbol": "A man making a futurist drawing", "interpretation": "Artist envisioning what hasn't yet manifested. Creation depicting tomorrow. You sketch or imagine possibilities beyond current reality."},
      "160": {"sign": "Virgo", "degree": 10, "symbol": "Two heads looking out and beyond the shadows", "interpretation": "Paired perception transcending darkness. Collaborative vision seeing past obstacles. You join others in looking toward light."},
      "161": {"sign": "Virgo", "degree": 11, "symbol": "A boy molded in his mother's aspirations for him", "interpretation": "Youth shaped by parental projection. Identity formed from another's dreams. You embody or witness the burden of fulfilling expectations."},
      "162": {"sign": "Virgo", "degree": 12, "symbol": "A bride with her veil snatched away", "interpretation": "Ceremony disrupted by revelation. Protection removed exposing vulnerability. You face or witness sudden transparency at crucial moments."},
      "163": {"sign": "Virgo", "degree": 13, "symbol": "A powerful statesman overcomes a state of political hysteria", "interpretation": "Leadership calming collective panic. Authority restoring order through force of character. You provide or receive stabilizing influence during social chaos."},
      "164": {"sign": "Virgo", "degree": 14, "symbol": "A family tree", "interpretation": "Lineage displayed visually. Ancestral connections made explicit. You trace or present the network of your origins."},
      "165": {"sign": "Virgo", "degree": 15, "symbol": "A fine lace ornamental handkerchief", "interpretation": "Delicate beauty with practical function. Refinement in everyday object. You appreciate or create elegance in small things."},
      "166": {"sign": "Virgo", "degree": 16, "symbol": "Children crowd around the orangutan cage at the zoo", "interpretation": "Youth fascinated by caged primal cousin. Innocent observation of contained wildness. You witness or remember the draw to what's both familiar and other."},
      "167": {"sign": "Virgo", "degree": 17, "symbol": "A volcano in eruption", "interpretation": "Contained pressure exploding violently. Earth releasing accumulated force. You experience or witness breakthrough that destroys to create."},
      "168": {"sign": "Virgo", "degree": 18, "symbol": "A Ouija board", "interpretation": "Tool for communication with invisible realms. Device channeling hidden messages. You use or encounter means of accessing what's normally inaccessible."},
      "169": {"sign": "Virgo", "degree": 19, "symbol": "A swimming race", "interpretation": "Competition in fluid medium. Contest requiring sustained effort through resistance. You participate in or observe struggle for achievement in challenging environment."},
      "170": {"sign": "Virgo", "degree": 20, "symbol": "An automobile caravan", "interpretation": "Collective journey by individual vehicles. Group travel maintaining separate units. You move with others while in your own container."},
      "171": {"sign": "Virgo", "degree": 21, "symbol": "A girls' basketball team", "interpretation": "Female cooperation in athletic contest. Women working together toward shared goal. You participate in or support collaborative competitive effort."},
      "172": {"sign": "Virgo", "degree": 22, "symbol": "A royal coat of arms", "interpretation": "Hereditary symbols of authority. Visual declaration of noble lineage. You display or recognize markers of inherited power."},
      "173": {"sign": "Virgo", "degree": 23, "symbol": "A lion tamer", "interpretation": "Human mastering dangerous beast. Courage controlling ferocity. You tame or witness the domestication of savage force."},
      "174": {"sign": "Virgo", "degree": 24, "symbol": "Mary and her white lamb", "interpretation": "Innocence accompanied by pure follower. Sacred companionship of girl and animal. You embody or witness relationship of tender guidance."},
      "175": {"sign": "Virgo", "degree": 25, "symbol": "A flag at half-mast", "interpretation": "Symbol of mourning displayed publicly. Collective acknowledgment of loss. You participate in or observe communal grief expressed."},
      "176": {"sign": "Virgo", "degree": 26, "symbol": "A boy with a censer serves the priest near the altar", "interpretation": "Youth assisting sacred ritual. Service to spiritual authority. You support or witness holy ceremony as apprentice."},
      "177": {"sign": "Virgo", "degree": 27, "symbol": "A group of aristocratic ladies meet ceremoniously at a court function", "interpretation": "Elite women gathering with formal protocol. High-status feminine congregation. You participate in or observe refined social ritual."},
      "178": {"sign": "Virgo", "degree": 28, "symbol": "A bald-headed man", "interpretation": "Masculinity marked by exposure. Identity revealed through loss. You embody or recognize strength in vulnerability or aging."},
      "179": {"sign": "Virgo", "degree": 29, "symbol": "A man gaining secret knowledge from an ancient scroll he is reading", "interpretation": "Hidden wisdom accessed through old text. Revelation from preserved teaching. You discover or transmit understanding kept across time."},
      "180": {"sign": "Virgo", "degree": 30, "symbol": "A false call unheard in attention to immediate service", "interpretation": "Distraction ignored through focus on duty. Commitment overriding interference. You maintain concentration despite attempted diversion."},
      "181": {"sign": "Libra", "degree": 1, "symbol": "A butterfly made perfect by a dart through it", "interpretation": "Beauty preserved through violence. Perfection achieved by killing. You witness or embody the paradox where completion requires destruction."},
      "182": {"sign": "Libra", "degree": 2, "symbol": "The transmutation of the fruits of past experiences into the seed-realizations of the forever creative spirit", "interpretation": "History distilled into future potential. Experience becoming essence. You transform what was into what can be."},
      "183": {"sign": "Libra", "degree": 3, "symbol": "The dawn of a new day reveals everything changed", "interpretation": "Morning showing total transformation. Light exposing complete shift. You wake to discover nothing remains as it was."},
      "184": {"sign": "Libra", "degree": 4, "symbol": "A group of young people sit in spiritual communion around a campfire", "interpretation": "Youth gathering in sacred circle. Collective meditation through flame. You join or create intimate spiritual community."},
      "185": {"sign": "Libra", "degree": 5, "symbol": "A man teaching the true inner knowledge", "interpretation": "Teacher transmitting esoteric wisdom. Education beyond surface understanding. You share or receive what's hidden from casual observation."},
      "186": {"sign": "Libra", "degree": 6, "symbol": "A man watches his ideals taking concrete form before his inner vision", "interpretation": "Witness to manifestation of dreams. Seeing imagination become real. You observe your visions solidifying."},
      "187": {"sign": "Libra", "degree": 7, "symbol": "A woman feeding chickens and protecting them from the hawks", "interpretation": "Nurturing while defending against predators. Care combined with vigilance. You sustain what's vulnerable while guarding against threats."},
      "188": {"sign": "Libra", "degree": 8, "symbol": "A blazing fireplace in a deserted home", "interpretation": "Warmth maintained in abandoned dwelling. Fire burning without witness. You sustain or encounter energy continuing despite absence."},
      "189": {"sign": "Libra", "degree": 9, "symbol": "Three old masters hanging in a special room in an art gallery", "interpretation": "Masterworks preserved and displayed. Genius honored through curation. You encounter or present excellence deserving reverence."},
      "190": {"sign": "Libra", "degree": 10, "symbol": "A canoe approaching safety through dangerous waters", "interpretation": "Small vessel navigating peril toward refuge. Vulnerable craft reaching shore. You guide or embody fragile hope making it through crisis."},
      "191": {"sign": "Libra", "degree": 11, "symbol": "A professor peering over his glasses", "interpretation": "Scholar examining beyond usual lens. Intellectual scrutiny with penetrating gaze. You see or embody analytical depth that looks past surface."},
      "192": {"sign": "Libra", "degree": 12, "symbol": "Miners emerging from a deep coal mine", "interpretation": "Workers returning from underground labor. Emergence from darkness into light. You complete or witness difficult descent followed by return."},
      "193": {"sign": "Libra", "degree": 13, "symbol": "Children blowing soap bubbles", "interpretation": "Youth creating ephemeral beauty. Innocent play with temporary forms. You delight in what's beautiful precisely because it won't last."},
      "194": {"sign": "Libra", "degree": 14, "symbol": "A noon siesta", "interpretation": "Rest during peak heat and light. Withdrawal at zenith. You pause or witness pause when energy is highest."},
      "195": {"sign": "Libra", "degree": 15, "symbol": "Circular paths", "interpretation": "Routes that return to beginning. Movement that completes cycles. You travel or recognize journeys that end where they started."},
      "196": {"sign": "Libra", "degree": 16, "symbol": "A boat landing washed away by a storm", "interpretation": "Access destroyed by natural force. Connection severed by turbulence. You lose or witness loss of the way to reach shore."},
      "197": {"sign": "Libra", "degree": 17, "symbol": "A retired sea captain watches ships entering and leaving the harbor", "interpretation": "Former voyager observing others' journeys. Seasoned wisdom witnessing continuing movement. You rest while watching those still in motion."},
      "198": {"sign": "Libra", "degree": 18, "symbol": "Two men placed under arrest", "interpretation": "Authority constraining individual freedom. Law capturing persons. You experience or witness power restricting liberty."},
      "199": {"sign": "Libra", "degree": 19, "symbol": "A gang of robbers in hiding", "interpretation": "Criminals concealed from justice. Outlaws awaiting opportunity. You hide or encounter those evading consequences."},
      "200": {"sign": "Libra", "degree": 20, "symbol": "A Jewish rabbi", "interpretation": "Religious leader of ancient tradition. Scholar of sacred law. You embody or encounter wisdom keeper of ancestral faith."},
      "201": {"sign": "Libra", "degree": 21, "symbol": "A crowd upon a beach", "interpretation": "Masses gathered at water's edge. Collective at boundary between elements. You join or observe many at the threshold."},
      "202": {"sign": "Libra", "degree": 22, "symbol": "A child giving birds a drink at a fountain", "interpretation": "Youth offering sustenance to wild creatures. Innocent generosity to nature. You nurture or witness caring for what flies free."},
      "203": {"sign": "Libra", "degree": 23, "symbol": "Chanticleer", "interpretation": "Rooster announcing dawn. Proud herald of new day. You proclaim or embody the voice that declares beginning."},
      "204": {"sign": "Libra", "degree": 24, "symbol": "A butterfly with the right wing more perfectly formed", "interpretation": "Beauty with asymmetric development. Imbalance in what should be paired. You embody or witness uneven growth in symmetrical form."},
      "205": {"sign": "Libra", "degree": 25, "symbol": "The sight of an autumn leaf brings to a pilgrim the sudden revelation of the mystery of life and death", "interpretation": "Epiphany from seasonal symbol. Dying leaf teaching ultimate truth. You receive or deliver understanding from simple observation."},
      "206": {"sign": "Libra", "degree": 26, "symbol": "An eagle and a large white dove turning one into the other", "interpretation": "Predator and peace becoming interchangeable. Power and gentleness transforming into each other. You witness or embody the unity of opposites."},
      "207": {"sign": "Libra", "degree": 27, "symbol": "An airplane sails high in clear skies", "interpretation": "Machine soaring in perfect conditions. Technology transcending earth effortlessly. You rise or witness rising above limitation."},
      "208": {"sign": "Libra", "degree": 28, "symbol": "A man in the midst of brightening influences", "interpretation": "Individual surrounded by illuminating forces. Darkness giving way around person. You stand or witness standing at center of emerging light."},
      "209": {"sign": "Libra", "degree": 29, "symbol": "Humanity seeking to span the bridge of knowledge", "interpretation": "Collective striving to connect understanding. Species building intellectual crossing. You participate in or witness the human drive to comprehend."},
      "210": {"sign": "Libra", "degree": 30, "symbol": "Three mounds of knowledge on a philosopher's head", "interpretation": "Wisdom accumulated in distinct areas. Expertise visible in multiple domains. You embody or recognize specialized understanding in separate fields."},
      "211": {"sign": "Scorpio", "degree": 1, "symbol": "A sight-seeing bus", "interpretation": "Vehicle designed for observation. Transportation prioritizing viewing. You travel or guide travel focused on witnessing rather than arriving."},
      "212": {"sign": "Scorpio", "degree": 2, "symbol": "A delicate bottle of perfume lies broken, releasing its fragrance", "interpretation": "Beauty released through destruction. Essence freed by breaking. You witness or embody how shattering spreads what was contained."},
      "213": {"sign": "Scorpio", "degree": 3, "symbol": "A house-raising party in a small village enlists the neighbors' cooperation", "interpretation": "Community joining to build shelter. Collective labor for individual benefit. You participate in or witness mutual aid that serves each through all."},
      "214": {"sign": "Scorpio", "degree": 4, "symbol": "A youth holding a lighted candle", "interpretation": "Young person carrying illumination. Novice bearing light forward. You guide or embody inexperience offering clarity."},
      "215": {"sign": "Scorpio", "degree": 5, "symbol": "A massive rocky shore", "interpretation": "Solid boundary against sea. Immovable meeting unstoppable. You stand or encounter the interface of permanence and change."},
      "216": {"sign": "Scorpio", "degree": 6, "symbol": "The gold rush tears men away from their native soil", "interpretation": "Wealth luring people from home. Opportunity destroying rootedness. You abandon or witness abandonment of origin for fortune."},
      "217": {"sign": "Scorpio", "degree": 7, "symbol": "Deep-sea divers", "interpretation": "Explorers descending into pressure. Courage to enter depths requiring protection. You dive or witness diving into what's normally inaccessible."},
      "218": {"sign": "Scorpio", "degree": 8, "symbol": "A calm lake bathed in moonlight", "interpretation": "Still water reflecting night luminary. Peace illuminated by feminine light. You rest in or witness tranquil beauty under lunar glow."},
      "219": {"sign": "Scorpio", "degree": 9, "symbol": "A dentist at work", "interpretation": "Professional addressing decay and pain. Skilled care through necessary hurt. You provide or receive healing that requires enduring discomfort."},
      "220": {"sign": "Scorpio", "degree": 10, "symbol": "A fellowship supper", "interpretation": "Communal meal celebrating connection. Shared food affirming bonds. You join or host eating that strengthens relationship."},
      "221": {"sign": "Scorpio", "degree": 11, "symbol": "A drowning man rescued", "interpretation": "Salvation from engulfment. Life saved from submersion. You rescue or are rescued from being overwhelmed."},
      "222": {"sign": "Scorpio", "degree": 12, "symbol": "An official embassy ball", "interpretation": "Formal gathering of diplomatic representatives. State ceremony bringing nations together. You participate in or witness high-level cultural exchange."},
      "223": {"sign": "Scorpio", "degree": 13, "symbol": "An inventor performs a laboratory experiment", "interpretation": "Creator testing new possibility. Innovation through controlled trial. You explore or witness exploration of what hasn't been proven."},
      "224": {"sign": "Scorpio", "degree": 14, "symbol": "Telephone linemen at work", "interpretation": "Workers maintaining communication infrastructure. Labor ensuring connection continues. You repair or witness repair of what keeps people linked."},
      "225": {"sign": "Scorpio", "degree": 15, "symbol": "Children playing around five mounds of sand", "interpretation": "Youth engaging with simple elements. Play that shapes formless material. You create or witness creation through innocent manipulation."},
      "226": {"sign": "Scorpio", "degree": 16, "symbol": "A girl's face breaking into a smile", "interpretation": "Feminine countenance transforming with joy. Expression shifting from neutral to delight. You witness or embody the moment happiness arrives."},
      "227": {"sign": "Scorpio", "degree": 17, "symbol": "A woman, fecundated by her own spirit, is great with child", "interpretation": "Self-impregnation through spiritual force. Creativity birthing without external seed. You generate or witness generation from within alone."},
      "228": {"sign": "Scorpio", "degree": 18, "symbol": "A woods rich in autumn coloring", "interpretation": "Forest displaying seasonal transformation. Nature decorated by decline. You appreciate or embody beauty in endings."},
      "229": {"sign": "Scorpio", "degree": 19, "symbol": "A parrot listening and then talking, repeats a conversation he has overheard", "interpretation": "Bird mimicking human speech. Mechanical reproduction of what was heard. You repeat or witness repetition without comprehension."},
      "230": {"sign": "Scorpio", "degree": 20, "symbol": "A woman drawing aside two dark curtains closing the entrance to a sacred pathway", "interpretation": "Feminine figure revealing hidden way. Guardian opening to mystery. You reveal or witness revelation of what was concealed."},
      "231": {"sign": "Scorpio", "degree": 21, "symbol": "A soldier derelict in duty", "interpretation": "Warrior failing obligation. Military abandoning post. You shirk or witness shirking of sworn responsibility."},
      "232": {"sign": "Scorpio", "degree": 22, "symbol": "Hunters starting out for ducks", "interpretation": "Armed pursuit of waterfowl beginning. Sport seeking to kill what flies. You embark on or witness organized predation."},
      "233": {"sign": "Scorpio", "degree": 23, "symbol": "A rabbit metamorphoses into a fairy", "interpretation": "Animal transforming into magical being. Nature becoming supernatural. You witness or embody evolution from creature to enchantment."},
      "234": {"sign": "Scorpio", "degree": 24, "symbol": "After having heard an inspired individual deliver his sermon, a throng of people are going home", "interpretation": "Crowd dispersing after spiritual teaching. Masses departing from revelation. You leave or witness leaving after receiving wisdom."},
      "235": {"sign": "Scorpio", "degree": 25, "symbol": "An X-ray photograph", "interpretation": "Image revealing internal structure. Technology showing what's hidden inside. You see or provide vision of concealed reality."},
      "236": {"sign": "Scorpio", "degree": 26, "symbol": "Indians making camp", "interpretation": "Indigenous people establishing temporary home. Native settlement creation. You build or witness building of provisional dwelling."},
      "237": {"sign": "Scorpio", "degree": 27, "symbol": "A military band marches noisily on through the city streets", "interpretation": "Martial music announcing presence loudly. Authority declaring itself through sound. You proclaim or witness proclamation of power."},
      "238": {"sign": "Scorpio", "degree": 28, "symbol": "The king of the fairies approaching his domain", "interpretation": "Magical sovereign nearing his realm. Ruler of enchantment returning home. You approach or witness approach to rightful territory."},
      "239": {"sign": "Scorpio", "degree": 29, "symbol": "An Indian squaw pleading to the chief for the lives of her children", "interpretation": "Mother begging authority to spare offspring. Feminine plea to masculine power for mercy. You appeal or witness appeal for loved ones' survival."},
      "240": {"sign": "Scorpio", "degree": 30, "symbol": "Children in Halloween costumes indulge in various pranks", "interpretation": "Youth in disguise playing mischievous tricks. Sanctioned rebellion through costume and chaos. You celebrate or witness permitted transgression."},
      "241": {"sign": "Sagittarius", "degree": 1, "symbol": "Retired army veterans gather to reawaken old memories", "interpretation": "Former soldiers reminiscing about shared past. Warriors meeting to remember battles. You reunite or witness reunion through common history."},
      "242": {"sign": "Sagittarius", "degree": 2, "symbol": "The ocean covered with whitecaps", "interpretation": "Sea displaying turbulent surface. Water showing agitation visibly. You witness or experience turmoil made manifest."},
      "243": {"sign": "Sagittarius", "degree": 3, "symbol": "Two men playing chess", "interpretation": "Strategic contest of minds. Intellectual combat through abstract game. You engage or witness engagement in calculated competition."},
      "244": {"sign": "Sagittarius", "degree": 4, "symbol": "A little child learning to walk with the encouragement of his parents", "interpretation": "Toddler attempting mobility with support. First steps aided by love. You try or witness trying with protective encouragement."},
      "245": {"sign": "Sagittarius", "degree": 5, "symbol": "An old owl sits alone on the branch of a large tree", "interpretation": "Ancient bird of wisdom in solitary perch. Knowledge waiting in isolation. You embody or recognize understanding that stands apart."},
      "246": {"sign": "Sagittarius", "degree": 6, "symbol": "A game of cricket", "interpretation": "Traditional sport requiring patience and skill. Cultural pastime demanding endurance. You participate in or witness refined competitive patience."},
      "247": {"sign": "Sagittarius", "degree": 7, "symbol": "Cupid knocks at the door of a human heart", "interpretation": "Love seeking entry to protected space. Desire requesting admission. You open or resist opening to romantic possibility."},
      "248": {"sign": "Sagittarius", "degree": 8, "symbol": "Within the depths of the earth, new elements are being formed", "interpretation": "Underground creation of basic substances. Hidden transformation at fundamental level. You participate in or recognize invisible generation."},
      "249": {"sign": "Sagittarius", "degree": 9, "symbol": "A mother leads her small child step by step up a steep stairway", "interpretation": "Maternal guidance through difficult ascent. Careful support through challenging climb. You guide or are guided patiently upward."},
      "250": {"sign": "Sagittarius", "degree": 10, "symbol": "A theatrical representation of a golden-haired goddess of opportunity", "interpretation": "Performance depicting fortunate timing personified. Art showing chance as divine feminine. You witness or embody luck made visible."},
      "251": {"sign": "Sagittarius", "degree": 11, "symbol": "The lamp of physical enlightenment at the left temple", "interpretation": "Light illuminating material understanding. Wisdom focused on worldly knowledge. You access or provide clarity about concrete reality."},
      "252": {"sign": "Sagittarius", "degree": 12, "symbol": "A flag that turns into an eagle that crows", "interpretation": "Symbol transforming into living creature and sound. Static becoming animated and vocal. You witness or embody meaning coming alive."},
      "253": {"sign": "Sagittarius", "degree": 13, "symbol": "A widow's past brought to light", "interpretation": "Bereaved woman's history revealed. Secrets of loss becoming known. You expose or witness exposure of grief's story."},
      "254": {"sign": "Sagittarius", "degree": 14, "symbol": "The pyramids and the Sphinx", "interpretation": "Ancient monuments of mystery and power. Enduring structures asking eternal questions. You encounter or embody timeless enigma."},
      "255": {"sign": "Sagittarius", "degree": 15, "symbol": "The ground hog looking for its shadow on Ground Hog Day, February 2nd", "interpretation": "Creature seeking omen about winter's length. Animal prophecy of seasonal change. You look for or provide signs about what's coming."},
      "256": {"sign": "Sagittarius", "degree": 16, "symbol": "Seagulls fly around a ship in expectation of food", "interpretation": "Birds following vessel anticipating nourishment. Wild creatures learning human patterns. You orbit or witness orbiting of what provides."},
      "257": {"sign": "Sagittarius", "degree": 17, "symbol": "An Easter sunrise service", "interpretation": "Dawn ceremony celebrating resurrection. Morning worship of renewal. You participate in or witness ritual of rebirth."},
      "258": {"sign": "Sagittarius", "degree": 18, "symbol": "Children playing on the beach, their heads protected by sunbonnets", "interpretation": "Youth enjoying shore with care taken. Play with protection from harm. You delight or witness delight with safety ensured."},
      "259": {"sign": "Sagittarius", "degree": 19, "symbol": "Pelicans, disturbed by the garbage of people, move to another habitat", "interpretation": "Birds relocating due to human pollution. Nature withdrawing from contamination. You flee or witness flight from degradation."},
      "260": {"sign": "Sagittarius", "degree": 20, "symbol": "In an old-fashioned northern village, men cut ice from a frozen pond for use during the summer", "interpretation": "Traditional harvest of winter cold for future cooling. Storing season for later need. You preserve or witness preservation across time."},
      "261": {"sign": "Sagittarius", "degree": 21, "symbol": "A child and a dog wearing borrowed eyeglasses", "interpretation": "Youth and animal with inappropriate vision aids. Innocents using tools not designed for them. You experiment or witness experimentation with ill-fitting solutions."},
      "262": {"sign": "Sagittarius", "degree": 22, "symbol": "A Chinese laundry", "interpretation": "Immigrant business serving community. Cultural labor in foreign land. You work or witness work bridging worlds."},
      "263": {"sign": "Sagittarius", "degree": 23, "symbol": "A group of immigrants as they fulfill the requirements of entrance into the new country", "interpretation": "Newcomers completing bureaucratic passage. Outsiders meeting conditions for inclusion. You undergo or witness transformation into belonging."},
      "264": {"sign": "Sagittarius", "degree": 24, "symbol": "A bluebird perched on the gate of a cottage", "interpretation": "Bird of happiness at threshold of home. Joy waiting at entrance to domestic space. You arrive or witness arrival of gladness."},
      "265": {"sign": "Sagittarius", "degree": 25, "symbol": "A chubby boy on a hobby-horse", "interpretation": "Plump child playing at riding. Youthful imagination creating movement. You pretend or witness pretending to journey."},
      "266": {"sign": "Sagittarius", "degree": 26, "symbol": "A flag-bearer", "interpretation": "Person carrying standard forward. Individual representing collective identity. You bear or witness bearing of what others follow."},
      "267": {"sign": "Sagittarius", "degree": 27, "symbol": "A sculptor at his work", "interpretation": "Artist shaping solid material. Creation through removal and addition. You form or witness forming of three-dimensional beauty."},
      "268": {"sign": "Sagittarius", "degree": 28, "symbol": "An old bridge over a beautiful stream", "interpretation": "Aged crossing over lovely flow. Enduring passage above changing water. You traverse or provide traversing of what runs beneath."},
      "269": {"sign": "Sagittarius", "degree": 29, "symbol": "A fat boy mowing the lawn", "interpretation": "Heavy youth performing outdoor labor. Unlikely worker doing necessary task. You complete or witness completion of effort despite appearance."},
      "270": {"sign": "Sagittarius", "degree": 30, "symbol": "The Pope blessing the faithful", "interpretation": "Highest authority conferring spiritual grace. Sacred leadership offering benediction. You receive or witness receiving of holy approval."},
      "271": {"sign": "Capricorn", "degree": 1, "symbol": "An Indian chief claims power from the assembled tribe", "interpretation": "Leader asserting authority before community. Chieftain demanding recognition from people. You claim or witness claiming of rightful power."},
      "272": {"sign": "Capricorn", "degree": 2, "symbol": "Three rose windows in a Gothic church, one damaged by war", "interpretation": "Sacred art partially destroyed by violence. Beauty marred by conflict. You witness or embody the scars war leaves on spirit."},
      "273": {"sign": "Capricorn", "degree": 3, "symbol": "A human soul, in its eagerness for new experiences, seeks embodiment", "interpretation": "Spirit desiring incarnation. Essence wanting physical form. You yearn or recognize yearning for material existence."},
      "274": {"sign": "Capricorn", "degree": 4, "symbol": "A group of people outfitting a large canoe at the start of a journey by water", "interpretation": "Collective preparing vessel for voyage. Community equipping boat for travel. You ready or witness readying for shared expedition."},
      "275": {"sign": "Capricorn", "degree": 5, "symbol": "Indians on the warpath. While some men row a well-filled canoe, others in it perform a war dance", "interpretation": "Warriors moving while displaying aggression. Travel combined with demonstration of force. You advance or witness advance with intimidation."},
      "276": {"sign": "Capricorn", "degree": 6, "symbol": "Ten logs lie under an archway leading to darker woods", "interpretation": "Material stored at passage to mystery. Resources accumulated before entering unknown. You gather or witness gathering before venturing deeper."},
      "277": {"sign": "Capricorn", "degree": 7, "symbol": "A veiled prophet speaks, seized by the power of a god", "interpretation": "Concealed seer channeling divine voice. Hidden messenger possessed by higher force. You speak or hear speaking from beyond."},
      "278": {"sign": "Capricorn", "degree": 8, "symbol": "In a sunlit home domesticated birds sing joyously", "interpretation": "Caged creatures happy in illuminated dwelling. Contained nature expressing delight. You witness or embody contentment despite restriction."},
      "279": {"sign": "Capricorn", "degree": 9, "symbol": "An angel carrying a harp", "interpretation": "Celestial being bearing musical instrument. Divine messenger with tool of harmony. You bring or witness bringing of heavenly beauty."},
      "280": {"sign": "Capricorn", "degree": 10, "symbol": "An albatross feeding from the hand of a sailor", "interpretation": "Wild sea bird trusting human. Untamed accepting offering from experienced voyager. You form or witness forming unlikely trust."},
      "281": {"sign": "Capricorn", "degree": 11, "symbol": "A large group of pheasant feathers", "interpretation": "Collected plumage of game birds. Ornamental remnants of hunted creatures. You gather or display trophies of pursuit."},
      "282": {"sign": "Capricorn", "degree": 12, "symbol": "An illustrated lecture on natural science reveals little-known aspects of life", "interpretation": "Educational presentation showing hidden realities. Teaching that unveils obscure truths. You learn or teach what's rarely seen."},
      "283": {"sign": "Capricorn", "degree": 13, "symbol": "A fire worshipper", "interpretation": "Devotee of flame as sacred. Reverence for transformative element. You honor or witness honoring of purifying force."},
      "284": {"sign": "Capricorn", "degree": 14, "symbol": "An ancient bas-relief carved in granite remains a witness to a long-forgotten culture", "interpretation": "Stone carving surviving vanished civilization. Art outlasting its creators. You encounter or create what endures beyond origin."},
      "285": {"sign": "Capricorn", "degree": 15, "symbol": "In a hospital, the children's ward is filled with toys", "interpretation": "Medical space humanized for young patients. Healing environment made playful. You comfort or witness comfort of suffering through joy."},
      "286": {"sign": "Capricorn", "degree": 16, "symbol": "School grounds filled with boys and girls in gymnasium suits", "interpretation": "Youth in athletic clothing for physical education. Students prepared for bodily development. You train or witness training of growing bodies."},
      "287": {"sign": "Capricorn", "degree": 17, "symbol": "A repressed woman finds a psychological release in nudism", "interpretation": "Constrained feminine finding freedom through exposure. Liberation achieved by removing covering. You free or witness freeing through vulnerability."},
      "288": {"sign": "Capricorn", "degree": 18, "symbol": "The Union Jack flies from a new British warship", "interpretation": "National symbol on military vessel. Identity displayed on instrument of power. You show or witness showing of allegiance through force."},
      "289": {"sign": "Capricorn", "degree": 19, "symbol": "A five-year-old girl carrying a bag filled with groceries", "interpretation": "Small child bearing adult burden. Youth shouldering responsibility beyond years. You carry or witness carrying what's too heavy for age."},
      "290": {"sign": "Capricorn", "degree": 20, "symbol": "A hidden choir is singing during a religious service", "interpretation": "Invisible voices providing sacred music. Unseen support creating holy atmosphere. You contribute or benefit from hidden assistance."},
      "291": {"sign": "Capricorn", "degree": 21, "symbol": "A relay race", "interpretation": "Team competition through sequential effort. Collective victory through individual segments. You pass or receive the responsibility to continue."},
      "292": {"sign": "Capricorn", "degree": 22, "symbol": "A general accepting defeat gracefully", "interpretation": "Military leader acknowledging loss with dignity. Authority yielding with honor. You surrender or witness surrender without shame."},
      "293": {"sign": "Capricorn", "degree": 23, "symbol": "Two awards for bravery in war", "interpretation": "Dual recognition of courage in combat. Multiple honors for valor. You receive or witness receiving acknowledgment of heroism."},
      "294": {"sign": "Capricorn", "degree": 24, "symbol": "A woman entering a convent", "interpretation": "Feminine commitment to religious life. Secular becoming sacred through vows. You withdraw or witness withdrawal from world for spirit."},
      "295": {"sign": "Capricorn", "degree": 25, "symbol": "A store filled with precious Oriental rugs", "interpretation": "Shop abundant with exotic valuable textiles. Commerce in foreign luxury. You trade or encounter trading in cultural treasures."},
      "296": {"sign": "Capricorn", "degree": 26, "symbol": "A nature spirit dancing in the iridescent mist of a waterfall", "interpretation": "Elemental being playing in spray and light. Magic visible in natural phenomenon. You witness or embody enchantment in nature."},
      "297": {"sign": "Capricorn", "degree": 27, "symbol": "Pilgrims climbing the steep steps leading to a mountain shrine", "interpretation": "Devoted travelers ascending to sacred site. Faithful enduring difficulty to reach holy place. You journey or witness journey toward spiritual goal."},
      "298": {"sign": "Capricorn", "degree": 28, "symbol": "A large aviary", "interpretation": "Enclosure housing many birds. Contained diversity of winged life. You create or witness creating space for varied flight."},
      "299": {"sign": "Capricorn", "degree": 29, "symbol": "A woman reading tea leaves", "interpretation": "Diviner interpreting residue patterns. Seer finding meaning in remains. You read or witness reading signs in what's left behind."},
      "300": {"sign": "Capricorn", "degree": 30, "symbol": "A secret meeting of men responsible for executive decisions in world affairs", "interpretation": "Hidden gathering of powerful decision-makers. Invisible elite determining collective fate. You participate in or sense the unseen forces shaping reality."},
      "301": {"sign": "Aquarius", "degree": 1, "symbol": "An old adobe mission in California", "interpretation": "Ancient religious outpost in new world. Sacred structure from colonial past. You encounter or embody spiritual heritage in changed land."},
      "302": {"sign": "Aquarius", "degree": 2, "symbol": "An unexpected thunderstorm", "interpretation": "Sudden electrical discharge without warning. Nature demonstrating unpredictable power. You experience or witness disruption arriving unannounced."},
      "303": {"sign": "Aquarius", "degree": 3, "symbol": "A deserter from the navy", "interpretation": "Sailor abandoning maritime service. Military oath broken through departure. You flee or witness fleeing from sworn duty."},
      "304": {"sign": "Aquarius", "degree": 4, "symbol": "A Hindu yogi demonstrates his healing powers", "interpretation": "Eastern mystic displaying therapeutic abilities. Spiritual master proving capacity to cure. You heal or witness healing through extraordinary means."},
      "305": {"sign": "Aquarius", "degree": 5, "symbol": "A council of ancestors is seen implementing the efforts of a young leader", "interpretation": "Elders supporting youth's initiatives. Ancestral wisdom enabling new action. You receive or provide backing across generations."},
      "306": {"sign": "Aquarius", "degree": 6, "symbol": "A masked figure performs ritualistic acts in a mystery play", "interpretation": "Concealed actor enacting sacred drama. Hidden identity performing symbolic actions. You participate in or witness theater revealing truth through disguise."},
      "307": {"sign": "Aquarius", "degree": 7, "symbol": "A child is seen being born out of an egg", "interpretation": "Human emerging from avian beginning. Life starting from unexpected origin. You witness or embody birth that defies normal process."},
      "308": {"sign": "Aquarius", "degree": 8, "symbol": "A large, beautiful public park", "interpretation": "Magnificent common space for all. Shared beauty accessible to everyone. You enjoy or create democratic access to loveliness."},
      "309": {"sign": "Aquarius", "degree": 9, "symbol": "A flag is seen turning into an eagle", "interpretation": "Symbol transforming into living force. Static becoming animated power. You witness or embody meaning coming alive with independence."},
      "310": {"sign": "Aquarius", "degree": 10, "symbol": "A man who had for a time become the embodiment of a popular ideal is made to realize that as a person he is not this ideal", "interpretation": "Individual awakening from projected role. Person distinguishing self from symbol. You separate or witness separation of identity from idealization."},
      "311": {"sign": "Aquarius", "degree": 11, "symbol": "During a silent hour, a man receives a new inspiration which may change his life", "interpretation": "Quiet moment bringing transformative insight. Stillness delivering revolutionary understanding. You receive or witness receiving of life-altering revelation."},
      "312": {"sign": "Aquarius", "degree": 12, "symbol": "On a vast staircase stand people of different types, graduated upward", "interpretation": "Hierarchy displayed vertically with diversity. Various beings arranged by elevation. You occupy or witness occupying levels in structured ascent."},
      "313": {"sign": "Aquarius", "degree": 13, "symbol": "A barometer", "interpretation": "Instrument measuring atmospheric pressure. Device predicting weather changes. You gauge or provide gauging of coming conditions."},
      "314": {"sign": "Aquarius", "degree": 14, "symbol": "A train entering a tunnel", "interpretation": "Vehicle disappearing underground. Movement into temporary darkness. You enter or witness entering obscurity with faith in emergence."},
      "315": {"sign": "Aquarius", "degree": 15, "symbol": "Two lovebirds sitting on a fence", "interpretation": "Paired creatures perched on boundary. Affection displayed at edge. You love or witness loving at threshold."},
      "316": {"sign": "Aquarius", "degree": 16, "symbol": "A big businessman at his desk", "interpretation": "Wealthy leader at command center. Authority managing enterprise. You direct or witness direction of commercial power."},
      "317": {"sign": "Aquarius", "degree": 17, "symbol": "A watchdog standing guard, protecting his master and his possessions", "interpretation": "Loyal animal defending owner and property. Devoted protection of what belongs. You guard or are guarded with fierce loyalty."},
      "318": {"sign": "Aquarius", "degree": 18, "symbol": "A man being unmasked at a masquerade", "interpretation": "Identity revealed at costume party. True face exposed during pretense. You unmask or are unmasked when disguise was expected."},
      "319": {"sign": "Aquarius", "degree": 19, "symbol": "A forest fire is being subdued by the use of water, chemicals and sheer muscular energy", "interpretation": "Conflagration controlled through multiple methods. Destruction stopped by combined forces. You fight or witness fighting chaos with varied tools."},
      "320": {"sign": "Aquarius", "degree": 20, "symbol": "A big white dove, a message bearer", "interpretation": "Large pale bird carrying communication. Peace symbol delivering news. You bring or receive messages of resolution."},
      "321": {"sign": "Aquarius", "degree": 21, "symbol": "A woman disappointed and disillusioned, courageously facing a seemingly empty life", "interpretation": "Female confronting loss of hope with bravery. Disenchantment met with courage. You face or witness facing emptiness without surrender."},
      "322": {"sign": "Aquarius", "degree": 22, "symbol": "A rug is placed on the floor of a nursery to allow children to play in comfort and warmth", "interpretation": "Soft covering creating safe play space. Comfort provided for innocent activity. You prepare or witness preparing protected environment for youth."},
      "323": {"sign": "Aquarius", "degree": 23, "symbol": "A big bear sitting down and waving all its paws", "interpretation": "Large animal gesturing playfully. Powerful creature acting friendly. You display or witness display of strength made gentle."},
      "324": {"sign": "Aquarius", "degree": 24, "symbol": "A man, having overcome his passions, teaches deep wisdom in terms of his experience", "interpretation": "Master sharing knowledge earned through struggle. Teacher offering wisdom from conquered desires. You instruct or learn from someone who has prevailed."},
      "325": {"sign": "Aquarius", "degree": 25, "symbol": "A butterfly with the right wing more perfectly formed", "interpretation": "Insect with asymmetric development. Beauty imbalanced in growth. You embody or witness uneven excellence."},
      "326": {"sign": "Aquarius", "degree": 26, "symbol": "A garage man testing a car's battery with a hydrometer", "interpretation": "Mechanic measuring stored electrical charge. Technician assessing power reserves. You check or witness checking of accumulated energy."},
      "327": {"sign": "Aquarius", "degree": 27, "symbol": "An ancient pottery bowl filled with fresh violets", "interpretation": "Old container holding new delicate blooms. Tradition bearing contemporary fragility. You combine or witness combining enduring form with ephemeral beauty."},
      "328": {"sign": "Aquarius", "degree": 28, "symbol": "A tree felled and sawed to ensure a supply of wood for the winter", "interpretation": "Living thing sacrificed for future warmth. Nature harvested for survival. You take or witness taking from abundance to prepare for scarcity."},
      "329": {"sign": "Aquarius", "degree": 29, "symbol": "A butterfly emerging from a chrysalis", "interpretation": "Transformed creature breaking free from cocoon. Metamorphosis completing into flight. You emerge or witness emergence into new form."},
      "330": {"sign": "Aquarius", "degree": 30, "symbol": "Deeply rooted in the past of a very ancient culture, a spiritual brotherhood in which many individual minds are merged into the glowing light of a unanimous consciousness is revealed to one who has emerged successfully from his metamorphosis", "interpretation": "Ancient collective consciousness revealed to transformed seeker. Mystical unity shown to one who has changed. You access or witness accessing timeless spiritual communion after personal evolution."},
      "331": {"sign": "Pisces", "degree": 1, "symbol": "In a crowded marketplace farmers and middlemen display a great variety of products", "interpretation": "Commerce showing diverse offerings. Market abundance with multiple sources. You trade or witness trading in variety."},
      "332": {"sign": "Pisces", "degree": 2, "symbol": "A squirrel hiding from hunters", "interpretation": "Small creature evading predators. Vulnerable life protecting itself from threat. You hide or witness hiding from danger."},
      "333": {"sign": "Pisces", "degree": 3, "symbol": "Petrified tree trunks lie broken on desert sand", "interpretation": "Ancient wood turned to stone in barren land. Life transformed to mineral in desolation. You encounter or embody permanence achieved through death."},
      "334": {"sign": "Pisces", "degree": 4, "symbol": "Heavy car traffic on a narrow isthmus linking two seashore resorts", "interpretation": "Congestion on slender passage between destinations. Crowding at connection between pleasures. You navigate or witness navigating bottleneck between desires."},
      "335": {"sign": "Pisces", "degree": 5, "symbol": "A church bazaar", "interpretation": "Religious community selling goods for charity. Sacred space hosting commerce for good. You support or witness supporting faith through exchange."},
      "336": {"sign": "Pisces", "degree": 6, "symbol": "A parade of army officers in full dress", "interpretation": "Military leadership displaying formal splendor. Authority showing itself ceremonially. You witness or participate in official pageantry of power."},
      "337": {"sign": "Pisces", "degree": 7, "symbol": "Illumined by a shaft of light, a large cross lies on rocks surrounded by sea mist", "interpretation": "Sacred symbol highlighted in liminal space. Religious marker visible through fog and light. You discover or embody meaning revealed through mystery."},
      "338": {"sign": "Pisces", "degree": 8, "symbol": "A girl blowing a bugle", "interpretation": "Young female making loud announcement. Feminine voice commanding attention through instrument. You proclaim or witness proclamation by unexpected herald."},
      "339": {"sign": "Pisces", "degree": 9, "symbol": "A jockey", "interpretation": "Rider directing powerful animal in race. Small human controlling large force. You guide or witness guiding greater strength toward victory."},
      "340": {"sign": "Pisces", "degree": 10, "symbol": "An aviator in the clouds", "interpretation": "Flyer surrounded by vapor. Navigator within obscurity. You travel or witness traveling through uncertainty with skill."},
      "341": {"sign": "Pisces", "degree": 11, "symbol": "Men traveling a narrow path, seeking illumination", "interpretation": "Seekers on restricted route toward enlightenment. Pilgrims constrained but purposeful. You journey or witness journey on disciplined spiritual path."},
      "342": {"sign": "Pisces", "degree": 12, "symbol": "In the sanctuary of an occult brotherhood, newly initiated members are being examined and their character tested", "interpretation": "Secret society evaluating novices. Hidden order assessing worthiness. You undergo or administer trials of belonging."},
      "343": {"sign": "Pisces", "degree": 13, "symbol": "An ancient sword, used in many battles, is displayed in a museum", "interpretation": "Weapon of violence preserved as artifact. Tool of war becoming object of memory. You honor or witness honoring of past conflict."},
      "344": {"sign": "Pisces", "degree": 14, "symbol": "A lady wrapped in fox fur", "interpretation": "Woman adorned with animal pelt. Feminine protected by cunning creature's coat. You wear or witness wearing beauty through another's sacrifice."},
      "345": {"sign": "Pisces", "degree": 15, "symbol": "An officer instructing his men before a simulated assault under a barrage of live shells", "interpretation": "Leader teaching through dangerous practice. Authority training subordinates in real peril. You prepare or witness preparation through authentic risk."},
      "346": {"sign": "Pisces", "degree": 16, "symbol": "In the quiet of his study a creative individual experiences a flow of inspiration", "interpretation": "Artist receiving vision in private space. Creator channeling in solitude. You access or witness accessing muse in protected retreat."},
      "347": {"sign": "Pisces", "degree": 17, "symbol": "An Easter parade", "interpretation": "Springtime celebration of resurrection. Public display of renewal faith. You participate in or witness collective acknowledgment of rebirth."},
      "348": {"sign": "Pisces", "degree": 18, "symbol": "A giant standing guard at the entrance to a secret meeting of conspiracy plotters", "interpretation": "Enormous sentinel protecting clandestine gathering. Massive guardian of hidden plans. You defend or encounter defense of concealed intentions."},
      "349": {"sign": "Pisces", "degree": 19, "symbol": "A master instructing his disciple", "interpretation": "Teacher transmitting to student. Wisdom passing from expert to learner. You teach or learn in sacred lineage."},
      "350": {"sign": "Pisces", "degree": 20, "symbol": "A table set for an evening meal", "interpretation": "Dining space prepared for nourishment. Hospitality ready for guests. You prepare or enter space of anticipated sharing."},
      "351": {"sign": "Pisces", "degree": 21, "symbol": "Under the watchful and kind eye of a Chinese servant, a girl fondles a little white lamb", "interpretation": "Child tending young animal under caring supervision. Innocence protected while nurturing innocence. You oversee or experience protected gentleness."},
      "352": {"sign": "Pisces", "degree": 22, "symbol": "A prophet carrying tablets of the new law is walking down the slopes of Mount Sinai", "interpretation": "Divine messenger delivering sacred code. Authority descending with commandments. You bring or receive fundamental principles from heights."},
      "353": {"sign": "Pisces", "degree": 23, "symbol": "A spiritist materializing phenomenon at a seance", "interpretation": "Medium manifesting invisible presences. Channeler making unseen visible. You bridge or witness bridging between worlds."},
      "354": {"sign": "Pisces", "degree": 24, "symbol": "On a small island surrounded by the vast expanse of the sea, people are seen living in close interaction", "interpretation": "Isolated community in intimate connection. Small group surrounded by immensity. You join or witness joining in bound togetherness."},
      "355": {"sign": "Pisces", "degree": 25, "symbol": "The purging of the priesthood", "interpretation": "Religious leadership undergoing cleansing. Sacred office being purified. You witness or undergo spiritual authority's reformation."},
      "356": {"sign": "Pisces", "degree": 26, "symbol": "Watching the very thin moon crescent appearing at sunset, different people realize that the time has come to go ahead with their different projects", "interpretation": "New lunar phase prompting varied action. Celestial sign initiating multiple beginnings. You start or witness starting when cosmos signals readiness."},
      "357": {"sign": "Pisces", "degree": 27, "symbol": "The harvest moon illuminates a clear autumnal sky", "interpretation": "Full moon of gathering season lighting night. Abundant lunar presence during reaping time. You witness or embody illumination during collection."},
      "358": {"sign": "Pisces", "degree": 28, "symbol": "A fertile garden under the full moon", "interpretation": "Productive earth bathed in complete lunar light. Growth visible under feminine illumination. You cultivate or witness cultivation revealed by reflected light."},
      "359": {"sign": "Pisces", "degree": 29, "symbol": "Light breaking into many colors as it passes through a prism", "interpretation": "Unity dividing into spectrum. Wholeness revealing constituent parts. You witness or embody the one becoming many through refraction."},
      "360": {"sign": "Pisces", "degree": 30, "symbol": "A majestic rock formation resembling a face is idealized by a boy who takes it as his ideal of greatness, and as he grows up, begins to look like it", "interpretation": "Youth modeling self on natural formation. Human becoming what he admires. You transform or witness transformation into the image held sacred—the ultimate symbol of incarnating vision, completing the circle of the zodiac where spirit returns to matter, imagination becomes flesh, and the dreamer becomes the dream."}
      }
    },

  "asteroids": {
  "description": "Beyond the major planets, thousands of asteroids add nuanced detail to your chart. The major asteroids represent archetypal energies, while personal name asteroids create intimate cosmic signatures.",
  
  "major_asteroids": {
    "1": {
      "name": "Ceres",
      "keywords": "nurturing, motherhood, food, agriculture, loss and return",
      "interpretation": "Ceres shows how you nurture and wish to be nurtured. Where you care for others, your relationship with food and resources, and how you handle separation. This is the Great Mother asteroid - your capacity to feed, sustain, and let go.",
      "in_signs": {
        "Aries": "You nurture through encouragement to be independent. Feeding others' courage and initiative. May struggle with smothering vs. freedom.",
        "Taurus": "You nurture through physical comfort and material security. Food and touch are your love languages. Natural at creating abundance.",
        "Gemini": "You nurture through communication and mental stimulation. Teaching and conversation feed your soul. May over-think care-giving.",
        "Cancer": "You nurture instinctively and emotionally. Food equals love. Deeply maternal/paternal regardless of gender. Can be clingy.",
        "Leo": "You nurture through celebrating others. Generous praise and attention. Need appreciation for your care-giving.",
        "Virgo": "You nurture through service and health consciousness. Practical care and problem-solving. Can be critical in attempts to help.",
        "Libra": "You nurture through creating harmony and beauty. Relationship-focused care. May avoid necessary confrontation.",
        "Scorpio": "You nurture through intense emotional bonding. Transformative care that goes deep. Can be possessive.",
        "Sagittarius": "You nurture through sharing wisdom and adventure. Freedom within care. May neglect daily practical needs.",
        "Capricorn": "You nurture through structure and responsibility. Serious about care-giving. May be emotionally reserved.",
        "Aquarius": "You nurture the collective and through friendship. Unconventional care. May seem detached personally.",
        "Pisces": "You nurture through empathy and spiritual connection. Boundaryless compassion. Can lose self in care-giving."
      }
    },
    "2": {
      "name": "Pallas",
      "keywords": "wisdom, strategy, creative intelligence, pattern recognition, healing",
      "interpretation": "Pallas (Pallas Athena) shows your wisdom, how you solve problems creatively, your strategic thinking, and capacity for pattern recognition. This is the warrior-artist asteroid - combining intellect with action, wisdom with craft.",
      "in_signs": {
        "Aries": "Quick strategic thinking. Warrior wisdom. You solve problems through direct action and bold moves.",
        "Taurus": "Patient strategic planning. Wisdom through the senses. You solve problems through practical, grounded approaches.",
        "Gemini": "Intellectual strategy. Multiple solution thinking. You solve problems through communication and clever tactics.",
        "Cancer": "Emotional intelligence. Intuitive strategy. You solve problems by reading feelings and protective instincts.",
        "Leo": "Creative problem-solving. Dramatic wisdom. You solve problems through self-expression and confident action.",
        "Virgo": "Analytical strategy. Precise wisdom. You solve problems through detailed analysis and systematic approaches.",
        "Libra": "Diplomatic strategy. Wisdom through balance. You solve problems through negotiation and aesthetic solutions.",
        "Scorpio": "Psychological strategy. Deep wisdom. You solve problems by understanding hidden motivations and power dynamics.",
        "Sagittarius": "Philosophical strategy. Expansive wisdom. You solve problems through seeing the bigger picture and taking risks.",
        "Capricorn": "Executive strategy. Mature wisdom. You solve problems through structure, authority, and long-term planning.",
        "Aquarius": "Innovative strategy. Revolutionary wisdom. You solve problems through unconventional, future-oriented thinking.",
        "Pisces": "Intuitive strategy. Mystical wisdom. You solve problems through spiritual insight and artistic vision."
      }
    },
    "3": {
      "name": "Juno",
      "keywords": "marriage, partnership, commitment, jealousy, equality in relationship",
      "interpretation": "Juno shows what you need in committed partnership, your marriage style, issues of loyalty and jealousy, and the quality you seek in a life partner. This is the wife asteroid - your relationship with commitment itself.",
      "in_signs": {
        "Aries": "You need independence within commitment. Partner must respect your autonomy. Can be competitive in relationships.",
        "Taurus": "You need stability and sensuality in commitment. Loyal but possessive. Material security matters in partnership.",
        "Gemini": "You need intellectual connection and variety in commitment. Mental stimulation keeps partnership alive. Can be inconsistent.",
        "Cancer": "You need emotional security and nurturing in commitment. Family-oriented partnerships. Can be moody or clingy.",
        "Leo": "You need admiration and romance in commitment. Generous but expect loyalty. Partnership must be special and celebrated.",
        "Virgo": "You need practicality and service in commitment. Helpful but critical. Partnership must be useful and improving.",
        "Libra": "You need equality and harmony in commitment. Natural at partnership but can lose self. Marriage is central to identity.",
        "Scorpio": "You need depth and intensity in commitment. Passionate but jealous. Partnership must transform and merge souls.",
        "Sagittarius": "You need freedom and growth in commitment. Adventurous but reluctant to be tied down. Partnership must expand horizons.",
        "Capricorn": "You need respect and stability in commitment. Traditional values. Partnership must support ambitions.",
        "Aquarius": "You need friendship and independence in commitment. Unconventional partnerships. Need space within togetherness.",
        "Pisces": "You need spiritual and romantic unity in commitment. Idealistic about partnership. Can be self-sacrificing or disappointed."
      }
    },
    "4": {
      "name": "Vesta",
      "keywords": "sacred service, devotion, focus, sexuality, what you tend",
      "interpretation": "Vesta shows where you focus devotedly, your sacred service, relationship with sexuality and commitment to cause. This is the priestess asteroid - what you tend like a sacred flame, and where you can be celibate in service to something greater.",
      "in_signs": {
        "Aries": "Devoted to independence and initiative. Sacred fire of self. Sexuality tied to conquest and freedom.",
        "Taurus": "Devoted to stability and beauty. Sacred relationship with body. Sexuality tied to sensuality and loyalty.",
        "Gemini": "Devoted to learning and communication. Sacred mind. Sexuality tied to mental connection and variety.",
        "Cancer": "Devoted to family and emotional security. Sacred home. Sexuality tied to emotional safety and nurturing.",
        "Leo": "Devoted to creativity and self-expression. Sacred self. Sexuality tied to being adored and dramatic passion.",
        "Virgo": "Devoted to service and perfection. Sacred work. Sexuality tied to purity and health consciousness.",
        "Libra": "Devoted to harmony and partnership. Sacred relationship. Sexuality tied to beauty and equality.",
        "Scorpio": "Devoted to transformation and depth. Sacred intensity. Sexuality is transformative, powerful, possibly celibate or extreme.",
        "Sagittarius": "Devoted to truth and freedom. Sacred quest. Sexuality tied to adventure and philosophical connection.",
        "Capricorn": "Devoted to achievement and responsibility. Sacred ambition. Sexuality controlled, tied to respect and status.",
        "Aquarius": "Devoted to innovation and humanity. Sacred ideals. Sexuality unconventional, possibly detached or collective-focused.",
        "Pisces": "Devoted to spirituality and transcendence. Sacred compassion. Sexuality mystical, possibly celibate or merged with divine."
      }
    },
    "433": {
      "name": "Eros",
      "keywords": "erotic love, passion, desire, what turns you on",
      "interpretation": "Eros shows your erotic nature, what you find sexually attractive, how you experience desire, and the nature of your turn-ons. This is passion itself - raw, sexual, magnetic attraction.",
      "in_signs": {
        "Aries": "Turned on by confidence, aggression, competition. Direct sexual expression. Quick arousal and conquest.",
        "Taurus": "Turned on by sensuality, touch, luxury. Slow, physical seduction. Enduring passion through the senses.",
        "Gemini": "Turned on by wit, conversation, variety. Mental seduction. Curiosity and experimentation in intimacy.",
        "Cancer": "Turned on by emotion, nurturing, familiarity. Need safety for passion. Desire tied to feelings and care.",
        "Leo": "Turned on by attention, drama, being desired. Passionate display. Generous and theatrical in intimacy.",
        "Virgo": "Turned on by service, health, perfection. Modest but particular. Passion through attention to detail.",
        "Libra": "Turned on by beauty, romance, equality. Aesthetic seduction. Desire for balanced, harmonious intimacy.",
        "Scorpio": "Turned on by intensity, power, taboo. Transformative sexuality. Deep, possessive, all-consuming desire.",
        "Sagittarius": "Turned on by adventure, freedom, philosophy. Exploratory passion. Desire for meaning and expansion.",
        "Capricorn": "Turned on by authority, achievement, maturity. Controlled passion. Desire for respect and mastery.",
        "Aquarius": "Turned on by uniqueness, friendship, innovation. Unconventional sexuality. Desire for mental and social connection.",
        "Pisces": "Turned on by spirituality, fantasy, merging. Romantic idealism. Desire for transcendent, boundaryless union."
      }
    },
    "16": {
      "name": "Psyche",
      "keywords": "soul connection, psychological depth, the beloved, trials in love",
      "interpretation": "Psyche shows your soul's journey in love, psychological needs in relationship, and the trials you undergo to achieve true intimacy. This is the soul-mate asteroid - where you meet your deepest self through another.",
      "in_signs": {
        "Aries": "Soul grows through independence battles. Psychological need to be first. Trials involving courage and self-assertion.",
        "Taurus": "Soul grows through material and sensory experience. Psychological need for stability. Trials involving worth and attachment.",
        "Gemini": "Soul grows through communication and learning. Psychological need for mental connection. Trials involving truth and commitment.",
        "Cancer": "Soul grows through emotional bonding and family. Psychological need for safety. Trials involving vulnerability and boundaries.",
        "Leo": "Soul grows through self-expression and being seen. Psychological need for recognition. Trials involving pride and authenticity.",
        "Virgo": "Soul grows through service and refinement. Psychological need for usefulness. Trials involving perfectionism and acceptance.",
        "Libra": "Soul grows through relationship and balance. Psychological need for partnership. Trials involving self-loss and equality.",
        "Scorpio": "Soul grows through transformation and depth. Psychological need for intensity. Trials involving trust and power.",
        "Sagittarius": "Soul grows through exploration and meaning. Psychological need for freedom. Trials involving commitment and truth.",
        "Capricorn": "Soul grows through achievement and responsibility. Psychological need for respect. Trials involving vulnerability and time.",
        "Aquarius": "Soul grows through innovation and detachment. Psychological need for independence. Trials involving connection and humanity.",
        "Pisces": "Soul grows through compassion and transcendence. Psychological need for union. Trials involving boundaries and reality."
      },
    
      
  "thematic_groups": {
    "love_and_romance": {
      "description": "Asteroids related to love, romance, passion, and attraction",
      "asteroids": {
        "433": "Eros - Erotic love and passion",
        "763": "Cupido - Romantic attraction",
        "1221": "Amor - Unconditional love",
        "447": "Valentine - Romantic devotion",
        "80": "Sappho - Poetic love and same-sex attraction",
        "1388": "Aphrodite - Beauty and sexual allure"
      }
    },
    "career_and_success": {
      "description": "Asteroids related to career, achievement, and material success",
      "asteroids": {
        "19": "Fortuna - Luck and fortune",
        "158": "Koronis - Status and reputation",
        "151": "Abundantia - Abundance and prosperity",
        "912": "Maritima - Sea trade and commerce",
        "93": "Minerva - Wisdom in work"
      }
    },
    "spiritual_and_karmic": {
      "description": "Asteroids related to spirituality, karma, and fate",
      "asteroids": {
        "3811": "Karma - Karmic lessons",
        "128": "Nemesis - Karmic justice and reckoning",
        "19521": "Chaos - Primordial void and potential",
        "58534": "Logos - Divine word and reason",
        "5731": "Zeus - Divine authority",
        "896": "Sphinx - Mysteries and riddles"
      }
    },
    "healing": {
      "description": "Asteroids related to healing, medicine, and wellness",
      "asteroids": {
        "10": "Hygiea - Health and hygiene",
        "2878": "Panacea - Universal remedy",
        "1027": "Aesculapia - Medical skill"
      }
    },
    "creative_arts": {
      "description": "Asteroids related to creativity and artistic expression",
      "asteroids": {
        "1197": "Rhodesia - not used",
        "7": "Iris - Rainbow and messages",
        "22": "Kalliope - Epic poetry",
        "30": "Urania - Astronomy and universal love",
        "27": "Euterpe - Music and lyric poetry",
        "62": "Erato - Erotic poetry",
        "81": "Terpsichore - Dance",
        "18": "Melpomene - Tragedy",
        "23": "Thalia - Comedy",
        "33": "Polyhymnia - Sacred poetry"
              }
            }
          }
        }
      }
    },
  "hypothetical_bodies": {
    "description": "These are hypothetical or esoteric points used in Uranian and alternative astrology. They are for exploratory and entertainment purposes rather than traditional interpretation.",
    "bodies": {
      "Cupido": {
        "keywords": "unions, artistry, group bonds, aesthetic connection",
        "interpretation": "Cupido is linked with togetherness, social magnetism, and the urge to create or belong to a tribe. It highlights where you seek beauty, harmony and shared creative or relational experiences."
      },
      "Hades": {
        "keywords": "decay, the underbelly, shadow work, old karma",
        "interpretation": "Hades points to what is hidden, decaying, or uncomfortable but necessary to face. It can describe taboo material, old karma, and the need to compost the past into wisdom."
      },
      "Zeus": {
        "keywords": "focused will, ignition, directed energy, ambition",
        "interpretation": "Zeus concentrates drive and willpower. It shows where you can harness firepower, turn raw desire into a targeted plan, and initiate projects with force and precision."
      },
      "Kronos": {
        "keywords": "authority, high standards, mastery, reputation",
        "interpretation": "Kronos is about elevated status and the urge to rise above the ordinary. It can show where you seek mastery, command respect, and feel called to operate from a higher standard."
      },
      "Apollon": {
        "keywords": "expansion, multiplicity, science, trade",
        "interpretation": "Apollon spreads things out. It relates to broad networks, commerce, education, scientific thinking and the ability to handle many threads at once without losing the bigger picture."
      },
      "Admetos": {
        "keywords": "blockage, deep focus, crystallization, patience",
        "interpretation": "Admetos slows and concentrates. It can indicate where life feels stuck or heavy, but also where deep mastery, endurance and intense focus are possible over time."
      },
      "Vulcanus": {
        "keywords": "raw power, pressure, forging, inner strength",
        "interpretation": "Vulcanus symbolizes compressed power and the forging fire. It highlights where you can develop immense inner strength, or where pressure builds until transformation becomes unavoidable."
      },
      "Poseidon": {
        "keywords": "spirituality, insight, inspiration, higher mind",
        "interpretation": "Poseidon is linked with spiritual clarity, inspiration and subtle perception. It marks where your intuition, ideals and quest for meaning are especially active."
      },
      "Isis-Transpluto": {
        "keywords": "refinement, hyper-perfection, divine discrimination",
        "interpretation": "Isis-Transpluto points to an exacting, refining influence. It can describe where you strive for purity, self-sufficiency and razor-sharp discernment, sometimes to the point of over-critique."
      },
      "Nibiru": {
        "keywords": "collective disruption, long cycles, awakening shocks",
        "interpretation": "Nibiru is used as a symbol for large-scale shifts and disruptive cycles. It can indicate where you experience periodic upheavals that crack open awareness and reset the landscape."
      },
      "Vulcan": {
        "keywords": "inner forge, invisible work, sub-solar will",
        "interpretation": "Vulcan, the hypothetical intramercurian body, symbolizes invisible forging close to the heart of your identity. It highlights subtle inner work that shapes will, temperament and resilience."
      },
      "Selena": {
        "keywords": "idealized purity, inner light, protective grace",
        "interpretation": "Selena or White Moon represents an inner ideal of purity and quiet protection. It can show where you feel guided, blessed or held to a gentler, more luminous standard."
      },
      "Proserpina": {
        "keywords": "transition, liminal states, emerging power",
        "interpretation": "Proserpina speaks to crossing thresholds and reclaiming power after a descent. It marks where you move between worlds, identities or roles and slowly stabilize a new form."
      },
      "Waldemath": {
        "keywords": "ghost echoes, emotional residue, unseen tides",
        "interpretation": "Waldemath’s ‘Dark Moon’ is associated with ghost-like emotional patterns and subtle psychic weather. It can show where invisible tides and past echoes quietly tug at your feelings."
      },
      "Planet_9": {
        "keywords": "deep background fate, outer patterning, remote influence",
        "interpretation": "Planet 9 symbolizes remote but powerful background influences. It can describe slow-moving themes, ancestral patterns or collective currents that shape your life from far out of conscious view."
      },
      "Christ_Comet": {
        "keywords": "crisis of meaning, epochal turning points, revelation",
        "interpretation": "The Christ Comet is used symbolically for turning points that reframe meaning. It may highlight where crises or rare events catalyze a change in worldview or spiritual orientation."
        }
      }
    }
  }
}
